#include "basewindow.h"
#include "ui_basewin.h"
#include <QDesktopWidget>
#include <QApplication>
#include <QPainter>
#include <QFile>
#include <QDebug>

QStringList BaseWindow::testType=QString("B,C,C,C,B,B,B,B,C,C,"
                    "C,C,B,C,C,C,B,B,C,C,"
                    "C,C,B,C,C,C,C,C,B,C,"
                    "C,C,B,C,B,B,B,B,C,C,"
                    "C,C,B,C,C,C,B,B,B,C,"
                    "C,B").split(",",QString::SkipEmptyParts);
QStringList BaseWindow::testType2=QString("A,A,A,B,C,C,C,C,C,C,"
                    "B,B,C,B,B,C,C,B,C,C,"
                    "C,C,C,C,B,C,C,B,C,C,"
                    "C,C,B,B,C,C,C,C,C,C,"
                    "C,C,B,C,C,B,C,C,C,C,"
                    "B,C,C,C,C,B,C,B,B,B,"
                    "B,C,C,C,C,C,B,C,C,C,"
                    "B,B,C,B,C,B,C,B,A,A").split(",",QString::SkipEmptyParts);
QStringList BaseWindow::testName={"使用资料","通道与通道门","机房照明、照明开关","断错相保护","主开关与照明等电路的控制关系",
                                "驱动主机","紧急操作","限速器","接地连接","电气绝缘",
                    "井道安全门","井道检修门","极限开关","随行电缆","井道照明",
                    "底坑设施与装置","限速绳张紧装置的电器安全装置","缓冲器","轿顶电气装置","安全窗电气安全装置",
                    "对重（平衡重）固定","轿厢超面积载货电梯的控制条件","紧急照明和报警装置","地坎护脚板","轿厢超载保护装置",
                    "悬挂装置、补偿装置的磨损、断丝、变形等情况","端部固定","补偿装置","松绳（链）保护","旋转部件的防护",
                    "门间隙","玻璃门","防护门夹人的保护装置","门的运行与导向","自动关闭层门装置",
                    "紧急开锁装置","门的锁紧","门的闭合","门刀、门锁滚轮与地坎间隙","轿顶上或轿厢内的作业场地",
                    "底坑内的作业场地","平台上的作业场地","紧急操作和动态试验装置","附加检修装置与轿顶检修的互锁","轿厢上行超速保护装置试验",
                    "耗能缓冲器试验","轿厢限速器-安全钳联动试验","对重（平衡重）限速器-安全钳联动试验","空载曳引力试验","运行试验",
                    "消防返回功能试验","上行制动试验"};
QStringList BaseWindow::testName2={"制造资料","安装资料","改造、重大维修资料","使用资料","通道与通道门",
                                "机房（机器设备间）专用","安全空间","地面开口","照明与插座","断错相保护",
                    "主开关","驱动主机","制动装置","紧急操作","限速器",
                    "接地","电气绝缘","轿厢上行超速保护装置","井道封闭","曳引驱动电梯顶部空间",
                    "强制驱动电梯顶部空间","井道安全门","井道检修门","导轨","轿厢与井道壁距离",
                    "层门地坎下端井道壁","井道内防护","极限开关","随行电缆","井道照明",
                    "底坑设施与装置","底坑空间","限速绳张紧装置","缓冲器","对重（平衡重）下方空间的保护",
                    "轿顶电气装置","轿顶护栏","安全窗（门）","轿厢对重（平衡重）间距","对重（平衡重）的固定",
                    "轿厢面积","轿厢内铭牌","紧急照明和报警装置","地坎护脚板","超载保护装置",
                    "安全钳","悬挂装置、补偿装置的磨损、断丝、变形等情况","端部固定","补偿装置","钢丝绳的卷绕",
                    "松绳（链）保护","旋转部件的防护","门地坎距离","门间隙","玻璃门",
                    "防止门夹人的保护装置","门的运行与导向","自动关闭层门装置","紧急开锁装置","门的锁紧",
                    "门的闭合","门刀、门锁滚轮与地坎间隙","作业场地总要求","轿顶上或轿厢内的作业场地","底坑内的作业场地",
                    "平台上的作业场地","紧急操作与动态试验装置","附加检修控制装置","轿厢上行超速保护装置试验","耗能缓冲器试验",
                    "轿厢限速器-安全钳联动试验","对重（平衡重）限速器-安全钳联动试验","平衡系数试验","空载曳引力试验","运行试验",
                    "消防返回功能试验","电梯速度","上行制动试验","下行制动试验","静态曳引试验"
                                  };
QVector<QStringList> BaseWindow::testMethod={QStringList("定期检验和改造、重大维修过程的监督检验时查验；新"
                                           "安装电梯的监督检验进行试验时查验(3)、 (4)、 (5)项，"
                                           "以及(2)项中所需记录表格制定情况[如试验时使用单"
                                           "位尚未确定，应当由安装单位提供(2)、(3)、(4)项查"
                                           "验内容范本，(5)项相应要求交接备忘录]"),
                                           QStringList("审查自检结果，如对其有质疑，按照"
                                           "以下方法进行现场检验(以下 C 类"
                                           "项目只描述现场检验方法)：目测或者测量相关数据"),
                                           QStringList("目测，操作验证各开关的功能"),
                                           QStringList("(1)断开主开关，在其输出端，分别"
                                           "断开三相交流电源的任意一根导线后，"
                                           "闭合主开关，检查电梯能否启动；\r"
                                           "(2)断开主开关，在其输出端，调换"
                                           "三相交流电源的两根导线的相互"
                                           "位置后，闭合主开关，检查电梯能否启动"),
                                           QStringList("目测主开关的设置；断开主开关，"
                                           "观察、检查照明、插座、通风和报警"
                                           "装置的供电电路是否被切断 "),
                                           QStringList("目测；认为轮槽的磨损可能影响曳"
                                           "引能力时，进行8.11 项试验，对于"
                                           "轿厢面积超过规定的载货电梯还"
                                           "需进行 8.12 项试验，综合 8.6、8.10、"
                                           "8.11、 8.12 项试验结果验证轮槽磨"
                                           "损是否影响曳引能力"),
                                           QStringList("(1)目测；通过模拟操作检查电气安全"
                                           "装置和手动松闸功能\r"
                                           "(2)目测；通过模拟操"
                                           "作检查紧急电动运行装置功能\r"
                                           "(3)目测"),
                                           QStringList("(1)对照检查限速器型式试验合格证、"
                                           "调试证书、铭牌；\r"
                                           "(2)目测电气安全装置的设置；\r"
                                           "(3)审查限速器动作速度校验报告，对"
                                           "照限速器铭牌上的相关参数，判断动作"
                                           "速度是否符合要求\r"),
                                           QStringList("目测，必要时测量验证"),
             /*10行*/                      QStringList("由施工或者维护"
                                           "保养单位测量，检"
                                           "验人员现场观察、"
                                           "确认"),
                                           QStringList("(1)测量相关数"
                                           "据；\r"
                                           "(2)打开、关闭安"
                                           "全门，检查门的启"
                                           "闭和电梯启动情"
                                           "况\r"),
                                           QStringList("(1)测量相关数"
                                           "据；\r"
                                           "(2)打开、关闭安"
                                           "全门，检查门的启"
                                           "闭和电梯启动情"
                                           "况\r"),
                                           QStringList("(1)将上行(下行)限位开关"
                                           "(如果有)短接，以检修速度"
                                           "使位于顶层(底层)端站的轿"
                                           "厢向上(向下)运行，检查井"
                                           "道上端(下端)极限开关动作"
                                           "情况；\r"
                                           "(2)短接上下两端极限开关"
                                           "和限位开关(如果有)，以检"
                                           "修速度提升(下降)轿厢，使"
                                           "对重(轿厢)完全压在缓冲器"
                                           "上，检查极限开关动作状态；\r"
                                           "(3)目测判断强制驱动电梯"
                                           "极限开关切断供电的方式"),
                                           QStringList("目测"),
                                           QStringList("目测"),
                                           QStringList("目测；操作验证停"
                                           "止装置和井道灯"
                                           "开关功能"),
                                           QStringList("(1)目测张紧和导"
                                           "向装置；\r"
                                           "(2)电梯以检修速"
                                           "度运行，使电气安"
                                           "全装置动作，观察"
                                           "电梯运行状况\r"),
                                           QStringList("(1)对照检查缓冲"
                                           "器型式试验合格"
                                           "证和铭牌或者标"
                                           "签；\r"
                                           "(2)目测缓冲器的"
                                           "固定、液位和电气"
                                           "安全装置及对重"
                                           "越程距离标识；\r"
                                           "(3)定期检验时,查"
                                           "验当轿厢位于顶"
                                           "层端站平层位置"
                                           "时，对重装置撞板"
                                           "与其缓冲器顶面"
                                           "间的垂直距离"),
                                           QStringList("(1)目测检修运行"
                                           "控制装置、停止装"
                                           "置和电源插座的"
                                           "设置；\r"
                                           "(2)操作验证检修"
                                           "运行控制装置、安"
                                           "全装置和停止装"
                                           "置的功能"),
                 /*20行*/                  QStringList("操作验证"),
                                           QStringList("目测"),
                                           QStringList("(1)测量计算"
                                           "轿厢有效面"
                                           "积；\r"
                                           "(2)检查层站装卸"
                                           "区域额定载重量"
                                           "标志、电梯专用等"
                                           "措施"),
                                           QStringList("断开正常照明供"
                                           "电电源，分别验证"
                                           "紧急照明系统、紧"
                                           "急报警装置的功"
                                           "能"),
                                           QStringList("目测或者测量相"
                                           "关数据"),
                                           QStringList("进行加载试验，验"
                                           "证超载保护装置"
                                           "的功能"),
                                           QStringList("(1)用钢丝绳探伤仪或者放大镜全"
                                           "长检测或者分段抽测；测量并判断钢丝绳直径变化情况。测量时，以"
                                           "相距至少 1m 的两点进行，在每点相互垂直方向上测量两次，四次测量"
                                           "值的平均值，即为钢丝绳的实测直径；\r"
                                           "(2)采用其他类型悬挂装置的,按照制造单位提供的方法进行检验"),
                                           QStringList("目测，或者按照制造单位的规定进行检验"),
                                           QStringList("(1)目测补偿绳(链)端固定情况；\r"
                                           "(2)模拟断绳或者绳跳出时的状态，观察电气安全装置动作和电梯运行情况"),
                                           QStringList("轿厢以检修速度"
                                           "运行，使松绳(链)"
                                           "电气安全装置动"
                                           "作，观察电梯运行"
                                           "状况"),
                     /*30行*/              QStringList("目测"),
                                           QStringList("测量相关尺寸"),
                                           QStringList("目测"),
                                           QStringList("模拟动作试验"),
                                           QStringList("目测"),
                                           QStringList("抽取基站、端站以及20%其他层站的层门，"
                                           "将轿厢运行至开锁区域外，打开层门，观察层门关闭情况及防止重块"
                                           "坠落措施的有效性"),
                                           QStringList("抽取基站、端站以及20%其他层站的层门，"
                                           "用钥匙操作紧急开锁装置，验证其功能"),
                                           QStringList("(1)目测门锁及电气安"
                                           "全装置的设置；\r"
                                           "(2)目测锁紧元件的啮"
                                           "合情况，认为啮合长度"
                                           "可能不足时测量电气触"
                                           "点刚闭合时锁紧元件的"
                                           "啮合长度；\r"
                                           "(3)使电梯以检修速度"
                                           "运行，打开门锁，观察"
                                           "电梯是否停止"),
                                           QStringList("(1)使电梯以检修速度"
                                           "运行，打开层门，检查"
                                           "电梯是否停止；\r"
                                           "(2)将电梯置于检修状"
                                           "态，层门关闭，打开轿"
                                           "门，观察电梯能否运行；\r"
                                           "(3)对于由数个间接机"
                                           "械连接的门扇组成的滑"
                                           "动门，抽取轿门和基站、"
                                           "端站以及 20%其他层站"
                                           "的层门，短接被锁住门"
                                           "扇上的电气安全装置，"
                                           "使各门扇均打开，观察"
                                           "电梯能否运行"),
                                           QStringList("测量相关数据"),
                          /*40行*/         QStringList("(1)目测机械锁定装"
                                           "置、检修门(窗)、轿内"
                                           "检修控制装置的设置；\r"
                                           "(2)通过模拟操作以及"
                                           "使电气安全装置动作，"
                                           "检查机械锁定装置、轿"
                                           "内检修控制装置、电气"
                                           "安全装置的功能"),
                                           QStringList("(1)对于不具备相应安"
                                           "全措施的，核查电梯整"
                                           "机型式试验合格证书"
                                           "或者报告书，确认其上"
                                           "有无检查、维修工作无"
                                           "需移动轿厢且不可能"
                                           "导致轿厢失控和意外"
                                           "移动的说明；\r"
                                           "(2) 目 测 机 械 制 停 装"
                                           "置、井道外电气复位装"
                                           "置的设置；\r"
                                           "(3)通过模拟操作以及"
                                           "使电气安全装置动作，"
                                           "检查机械制停装置、井"
                                           "道外电气复位装置、电"
                                           "气安全装置的功能"),
                                           QStringList("(1)目测平台、平台护"
                                           "栏、机械锁定装置、活"
                                           "动式机械止挡装置的"
                                           "设置；\r"
                                           "(2)通过模拟操作以及"
                                           "使电气安全装置动作，"
                                           "检查机械锁定装置、活"
                                           "动式机械止挡装置、电"
                                           "气安全装置的功能"),
                                           QStringList("(1)目测或者结合相关"
                                           "试验，验证动态试验装"
                                           "置的功能；\r"
                                           "(2)在空载、半载、满"
                                           "载等工况(含轿厢与对"
                                           "重平衡的工况)，模拟"
                                           "停电或停梯故障，按照"
                                           "相应的应急救援程序\r"
                                           "进行操作。定期检验时"
                                           "在空载工况下进行。由"
                                           "施工或者维护保养单"
                                           "位进行操作，检验人员"
                                           "现场观察、确认；"
                                           "(3)操作停止装置，验"
                                           "证其功能\r"),
                                           QStringList("(1)目测附加检修装置"
                                           "的设置；\r"
                                           "(2)进行检修操作，检"
                                           "查检修控制装置的功"
                                           "能"),
                                           QStringList("由施工或者维护保养"
                                           "单位按照制造单位规"
                                           "定的方法进行试验，检"
                                           "验人员现场观察、确认"),
                                           QStringList("(1)将限位开关(如果"
                                           "有)、极限开关短接，以"
                                           "检修速度下降空载轿厢，"
                                           "将缓冲器压缩，观察电气"
                                           "安全装置动作情况；\r"
                                           "(2)将限位开关(如果"
                                           "有)、极限开关和相关的"
                                           "电气安全装置短接，以"
                                           "检修速度下降空载轿"
                                           "厢，将缓冲器完全压缩，"
                                           "测量从轿厢开始提起到"
                                           "缓冲器回复原状的时间"),
                                           QStringList("(1)施工监督检验：由施"
                                           "工单位进行试验，检验"
                                           "人员现场观察、确认；\r"
                                           "(2)定期检验："
                                           "短接限速器和安全钳的"
                                           "电气安全装置，轿厢空"
                                           "载，以检修速度向下运"
                                           "行，人为动作限速器，"
                                           "观察轿厢制停情况"),
                                           QStringList("短接限速器和安全钳的"
                                           "电气安全装置(如果"
                                           "有)，轿厢空载以检修速"
                                           "度向上运行，人为动作"
                                           "限速器，观察对重(平衡"
                                           "重)制停情况"),
                                           QStringList("将上限位开关(如果有)、极"
                                           "限开关和缓冲器柱塞复位开"
                                           "关(如果有)短接，以检修速"
                                           "度将空载轿厢提升，当对重"
                                           "压在缓冲器上后，继续使曳"
                                           "引机按上行方向旋转，观察"
                                           "是否出现曳引轮与曳引绳产"
                                           "生相对滑动现象，或者曳引"
                                           "机停止旋转"),
                          /*50行*/         QStringList("轿厢分别空载、满载，以正"
                                           "常运行速度上、下运行，观"
                                           "察运行情况"),
                                           QStringList("电梯在停止或者运行过程"
                                           "中，选择一些楼层呼梯，动"
                                           "作消防开关，检查电梯运行"
                                           "和开门状况"),
                                           QStringList("轿厢空载以正常运行速度上"
                                           "行至行程上部时，断开主开"
                                           "关，检查轿厢制停和变形损坏"
                                           "情况")
                                          };
QVector<QStringList> BaseWindow::testMethod2={QStringList("电梯安装施工前审查相应资料"),
                                           QStringList("审查相应资料。第"
                                              "(1)～(3)项在报"
                                              "检时审查，第(3)"
                                              "项在其他项目检"
                                             " 验时还应查验；第"
                                              "(4)、(5)项在试验"
                                              "时查验；第(6)项"
                                              "在竣工后审查"),
                                           QStringList("审查相应资料。第"
                                              "(1)～(4)项在报"
                                              "检时审查，第(4)"
                                              "项在其他项目检"
                                              "验时还应查验；第"
                                              "(5)项在试验时查"
                                              "验；第(6)项在竣"
                                              "工后审查"),
                                           QStringList("定期检验和改造、"
                                              "重大维修过程的监"
                                              "督检验时查验；新"
                                              "安装电梯的监督检"
                                              "验进行试验时查验"
                                              "(3)、(4)、(5)项，"
                                              "以及(2)项中所需"
                                              "记录表格制定情况"
                                              "[如试验时使用单"
                                              "位尚未确定，应当"
                                              "由 安 装 单 位 提 供"
                                              "(2)、(3)、(4)项查"
                                              "验内容范本，(5)项"
                                              "相应要求交接备忘"
                                              "录]"),
                                           QStringList("审查自检结果，如"
                                              "对其有质疑，按照"
                                              "以下方法进行现"
                                              "场检验(以下 C 类"
                                              "项目只描述现场"
                                              "检验方法)："
                                              "目测或者测量相"
                                              "关数据"),
                                           QStringList("目测"),
                                           QStringList("目测或者测量相关数据"),
                                           QStringList("目测或者测量相关数据"),
                                           QStringList("目测，操作验证各开关的功能"),
             /*10行*/                      QStringList("(1)断开主开关，"
                                              "在其输出端，分别"
                                              "断开三相交流电"
                                              "源的任意一根导"
                                              "线后，闭合主开"
                                              "关，检查电梯能否"
                                              "启动；"
                                              "(2)断开主开关，"
                                              "在其输出端，调换"
                                              "三相交流电源的"
                                              "两根导线的相互"
                                              "位置后，闭合主开"
                                              "关，检查电梯能否"
                                              "启动"),
                                           QStringList("目测主开关的设"
                                              "置；断开主开关，"
                                              "观察、检查照明、"
                                              "插座、通风和报警"
                                              "装置的供电电路"
                                              "是否被切断"),
                                           QStringList("目测；认为轮槽的"
                                              "磨损可能影响曳"
                                              "引能力时，进行"
                                              "8.11 项试验，对于"
                                              "轿厢面积超过规"
                                              "定的载货电梯还"
                                              "需进行 8.12 项试"
                                              "验，综合 8.6、8.10、"
                                              "8.11、 8.12 项试验"
                                              "结果验证轮槽磨"
                                              "损是否影响曳引"
                                              "能力"),
                                           QStringList("(1)对照型式试验报"
                                              "告，查验制动器；"
                                              "(2)根据电气原理图"
                                              "和实物状况， 结合模"
                                              "拟操作检查制动器"
                                              "的电气控制"),
                                           QStringList("目测；通过模拟操"
                                              "作检查电气安全装"
                                              "置和手动松闸功能"),
                                           QStringList("(1)对照检查限速"
                                              "器型式试验合格证、"
                                              "调试证书、铭牌；"
                                              "(2)目测电气安全"
                                              "装置的设置；"
                                              "(3)审查限速器动"
                                              "作速度校验报告，对"
                                              "照限速器铭牌上的"
                                              "相关参数，判断动作"
                                              "速度是否符合要求"),
                                           QStringList("目测，必要时测量验证"),
                                           QStringList("由施工或者维护"
                                              "保养单位测量，检"
                                              "验人员现场观察、"
                                              "确认"),
                                           QStringList("对照检查上行超"
                                              "速保护装置型式"
                                              "试验合格证和铭"
                                              "牌；目测动作试验"
                                              "方法的标注情况"),
                                           QStringList("目测"),
                 /*20行*/                  QStringList("(1)测量轿厢在上"
                                              "端站平层位置时"
                                              "的相应数据，计算"
                                              "确认是否满足要"
                                              "求；"
                                              "(2)用痕迹法或其"
                                              "他有效方法检验对"
                                              "重导轨的制导行"
                                              "程"),
                                           QStringList("(1)测量轿厢在上"
                                              "端 站 平 层 位 置 时"
                                              "的相应数据，计算"
                                              "确 认 是 否 满 足 要"
                                              "求；"
                                              "(2)用痕迹法或其"
                                              "他有效方法检验平"
                                              "衡 重 导 轨 的 制 导"
                                              "行程"),
                                           QStringList("(1) 测 量 相 关 数"
                                              "据；"
                                              "(2)打开、关闭安"
                                              "全门，检查门的启"
                                              "闭 和 电 梯 启 动 情"
                                              "况"),
                                           QStringList("(1) 测 量 相 关 数"
                                              "据；"
                                              "(2) 打开、关闭检"
                                              "修门，检查门的启"
                                              "闭 和 电 梯 启 动 情"
                                              "况"),
                                           QStringList("目测或者测量相关数据"),
                        /*25行*/           QStringList("测量相关数据；观察轿厢门锁设置情况"),
                                           QStringList("目测或者测量相关数据"),
                                           QStringList("目测或者测量相关数据"),
                                           QStringList("(1)将上行(下行)限位开关"
                                              "(如果有)短接，以检修速度"
                                              "使位于顶层(底层)端站的轿"
                                              "厢向上(向下)运行，检查井"
                                              "道上端(下端)极限开关动作"
                                              "情况；"
                                              "(2)短接上下两端极限开关"
                                              "和限位开关(如果有)，以检"
                                              "修速度提升(下降)轿厢，使"
                                              "对重(轿厢)完全压在缓冲器"
                                              "上，检查极限开关动作状态；"
                                              "(3)目测判断强制驱动电梯"
                                              "极限开关切断供电的方式"),
                                           QStringList("目测"),
                     /*30行*/              QStringList("目测"),
                                           QStringList("目测；操作验证停止装置和井道灯开关功能"),
                                           QStringList("测量轿厢在下端"
                                              "站平层位置时的"
                                              "相应数据，计算确"
                                              "认是否满足要求"),
                                           QStringList("(1)目测张紧和导"
                                              "向装置；"
                                              "(2)电梯以检修速"
                                              "度运行，使电气安"
                                              "全装置动作，观察"
                                              "电梯运行状况"),
                                           QStringList("(1)对照检查缓冲"
                                              "器 型 式 试 验 合 格"
                                              "证 和 铭 牌 或 者 标"
                                              "签；"
                                              "(2)目测缓冲器的"
                                              "固定、液位和电气"
                                              "安 全 装 置 及 对 重"
                                              "越程距离标识；"
                                              "(3)定期检验时,查"
                                              "验 当 轿 厢 位 于 顶"
                                              "层 端 站 平 层 位 置"
                                              "时，对重装置撞板"
                                              "与 其 缓 冲 器 顶 面"
                                              "间的垂直距离"),
                       /*35行*/             QStringList("目测"),
                                           QStringList("(1)目测检修运行"
                                              "控制装置、停止装"
                                              "置和电源插座的"
                                              "设置；"
                                              "(2)操作验证检修"
                                              "运行控制装置、安"
                                              "全装置和停止装"
                                              "置的功能"),
                                           QStringList("目测或者测量相关数据"),
                                           QStringList("操作验证"),
                                           QStringList("测量相关数据"),
                          /*40行*/         QStringList("目测"),
                                           QStringList("(1) 测 量 计 算"
                                              "轿 厢 有 效 面"
                                              "积；"
                                              "(2)检查层站装卸"
                                              "区域额定载重量"
                                              "标志、 电梯专用等"
                                              "措施"),
                                           QStringList("目测"),
                                           QStringList("断开正常照明供"
                                              "电电源， 分别验证"
                                              "紧急照明系统、紧"
                                              "急报警装置的功"
                                              "能"),
                                           QStringList("目测或者测量相关数据"),
                    /*45行*/                QStringList("进行加载试验，验"
                                              "证超载保护装置"
                                              "的功能"),
                                           QStringList("(1)对照检查安全"
                                              "钳型式试验合格证、"
                                              "调试证书和铭牌；"
                                              "(2)目测电气安全"
                                              "装置的设置"),
                                           QStringList("(1)用钢丝绳探伤"
                                              "仪或者放大镜全"
                                              "长检测或者分段"
                                              "抽测；测量并判断"
                                              "钢丝绳直径变化"
                                              "情况。测量时，以"
                                              "相距至少 1m 的两"
                                              "点进行，在每点相"
                                              "互垂直方向上测"
                                              "量两次，四次测量"
                                              "值的平均值，即为"
                                              "钢丝绳的实测直"
                                              "径；"
                                              "(2)采用其他类型"
                                              "悬挂装置的,按照"
                                              "制造单位提供的"
                                              "方法进行检验"),
                                           QStringList("目测，或者按照制"
                                              "造单位的规定进"
                                              "行检验"),
                                           QStringList("(1) 目 测 补 偿 绳"
                                              "(链)端固定情况；"
                                              "(2)模拟断绳或者"
                                              "绳跳出时的状态，"
                                              "观察电气安全装"
                                              "置动作和电梯运"
                                              "行情况"),
                          /*50行*/         QStringList("目测"),
                                           QStringList("轿 厢 以 检 修 速 度"
                                              "运行，使松绳(链)"
                                              "电 气 安 全 装 置 动"
                                              "作，观察电梯运行"
                                              "状况"),
                                           QStringList("目测"),
                                           QStringList("测量相关尺寸"),
                                           QStringList("测量相关尺寸"),
                          /*55*/           QStringList("目测"),
                                           QStringList("模拟动作试验"),
                                           QStringList("目测"),
                                           QStringList("抽 取 基 站 、 端 站 以 及"
                                              "20%其他层站的层门，"
                                              "将轿厢运行至开锁区域"
                                              "外，打开层门，观察层"
                                              "门关闭情况及防止重块"
                                              "坠落措施的有效性"),
                                           QStringList("抽 取 基 站 、 端 站 以 及"
                                              "20%其他层站的层门，"
                                              "用钥匙操作紧急开锁装"
                                              "置，验证其功能"),
                         /*60*/            QStringList("(1)目测门锁及电气安"
                                              "全装置的设置；"
                                              "(2)目测锁紧元件的啮"
                                              "合情况，认为啮合长度"
                                              "可能不足时测量电气触"
                                              "点刚闭合时锁紧元件的"
                                              "啮合长度；"
                                              "(3)使电梯以检修速度"
                                              "运行，打开门锁，观察"
                                              "电梯是否停止"),
                                           QStringList("(1)使电梯以检修速度"
                                              "运行，打开层门，检查"
                                              "电梯是否停止；"
                                              "(2)将电梯置于检修状"
                                              "态，层门关闭，打开轿"
                                              "门，观察电梯能否运行；"
                                              "(3)对于由数个间接机"
                                              "械连接的门扇组成的滑"
                                              "动门，抽取轿门和基站、"
                                              "端站以及 20%其他层站"
                                              "的层门，短接被锁住门"
                                              "扇上的电气安全装置，"
                                              "使各门扇均打开，观察"
                                              "电梯能否运行"),
                                           QStringList("测量相关数据"),
                                           QStringList("目测"),
                                           QStringList("(1) 目 测 机 械 锁 定 装"
                                              "置、检修门(窗)、轿内"
                                              "检修控制装置的设置；"
                                              "(2)通过模拟操作以及"
                                              "使电气安全装置动作，"
                                              "检查机械锁定装置、轿"
                                              "内检修控制装置、电气"
                                              "安全装置的功能"),
                       /*65*/              QStringList("(1)对于不具备相应安"
                                              "全措施的，核查电梯整"
                                              "机型式试验合格证书"
                                              "或者报告书，确认其上"
                                              "有无检查、维修工作无"
                                              "需移动轿厢且不可能"
                                              "导致轿厢失控和意外"
                                              "移动的说明；"
                                              "(2) 目 测 机 械 制 停 装"
                                              "置、井道外电气复位装"
                                              "置的设置；"
                                              "(3)通过模拟操作以及"
                                              "使电气安全装置动作，"
                                              "检查机械制停装置、井"
                                              "道外电气复位装置、电"
                                              "气安全装置的功能"),
                                           QStringList("(1)目测平台、平台护"
                                              "栏、机械锁定装置、活"
                                              "动式机械止挡装置的"
                                             "设置；"
                                              "(2)通过模拟操作以及"
                                              "使电气安全装置动作，"
                                              "检查机械锁定装置、活"
                                              "动式机械止挡装置、电"
                                              "气安全装置的功能"),
                                           QStringList("(1)目测或者结合相关"
                                              "试验，验证动态试验装"
                                              "置的功能；"
                                              "(2)在空载、半载、满"
                                              "载等工况(含轿厢与对"
                                              "重平衡的工况)，模拟"
                                              "停电或停梯故障，按照"
                                              "相应的应急救援程序"
                                              "进行操作。定期检验时"
                                              "在空载工况下进行。由"
                                              "施工或者维护保养单"
                                              "位进行操作，检验人员"
                                              "现场观察、确认；"
                                              "(3)操作停止装置，验"
                                              "证其功能"),
                                           QStringList("(1)目测附加检修装置"
                                              "的设置；"
                                              "(2)进行检修操作，检"
                                              "查检修控制装置的功"
                                              "能"),
                                           QStringList("由施工或者维护保养"
                                              "单位按照制造单位规"
                                              "定的方法进行试验，检"
                                              "验人员现场观察、确认"),
                      /*70*/               QStringList("(1) 将 限 位 开 关 ( 如 果"
                                              "有)、极限开关短接，以"
                                              "检修速度下降空载轿厢，"
                                              "将缓冲器压缩，观察电气"
                                              "安全装置动作情况；"
                                              "(2) 将 限 位 开 关 ( 如 果"
                                              "有)、极限开关和相关的"
                                              "电气安全装置短接，以"
                                              "检 修 速 度 下 降 空 载 轿"
                                              "厢，将缓冲器完全压缩，"
                                              "测量从轿厢开始提起到"
                                              "缓冲器回复原状的时间"),
                                           QStringList("(1)施工监督检验：由施"
                                              "工单位进行试验，检验"
                                              "人员现场观察、确认；"
                                              "(2)定期检验："
                                              "短接限速器和安全钳的"
                                              "电气安全装置，轿厢空"
                                              "载，以检修速度向下运"
                                              "行，人为动作限速器，"
                                              "观察轿厢制停情况"),
                                           QStringList("短接限速器和安全钳的"
                                              "电 气 安 全 装 置 ( 如 果"
                                              "有)，轿厢空载以检修速"
                                              "度向上运行，人为动作"
                                              "限速器，观察对重(平衡"
                                              "重)制停情况"),
                                           QStringList("轿厢分别装载额定载重量的"
                                              "30%、 40%、 45%、 50%、 60%"
                                              "作上、下全程运行，当轿厢"
                                              "和对重运行到同一水平位置"
                                              "时，记录电动机的电流值，"
                                              "绘制电流-负荷曲线以上、下"
                                              "行运行曲线的交点确定平衡"
                                              "系数"),
                                           QStringList("将上限位开关(如果有)、极"
                                              "限开关和缓冲器柱塞复位开"
                                              "关(如果有)短接，以检修速"
                                              "度将空载轿厢提升，当对重"
                                              "压在缓冲器上后，继续使曳"
                                              "引机按上行方向旋转，观察"
                                              "是否出现曳引轮与曳引绳产"
                                              "生相对滑动现象，或者曳引"
                                              "机停止旋转"),
                    /*75*/                 QStringList("轿厢分别空载、满载，以正"
                                              "常运行速度上、下运行，观"
                                              "察运行情况"),
                                           QStringList("电 梯 在 停 止 或 者 运 行 过 程"
                                              "中，选择一些楼层呼梯，动"
                                              "作消防开关，检查电梯运行"
                                              "和开门状况"),
                                           QStringList("用速度检测仪器进行检测"),
                                           QStringList("轿厢空载以正常运行速度上"
                                              "行至行程上部时，断开主开"
                                              "关，检查轿厢制停和变形损坏"
                                              "情况"),
                                           QStringList("由施工单位(定期检验时由维"
                                              "护保养单位)进行试验，检验"
                                              "人员现场观察、确认"
                                             " 注 A－6：定期检验如需进行此项"
                                              "目，按 B 类项目进行"),
                   /*80*/                  QStringList("由施工单位(定期检验时由维"
                                              "护保养单位)进行试验，检验"
                                              "人员现场观察、确认"
                                              "注 A－7：定期检验如需进行此项"
                                              "目，按 B 类项目进行")
                                          };

BaseWindow::BaseWindow(QWidget *parent)
    : QWidget(parent), ui(new Ui::Form)
{
    ui->setupUi(this);
    // FramelessWindowHint属性设置窗口去除边框;
    // WindowMinimizeButtonHint 属性设置在窗口最小化时，点击任务栏窗口可以显示出原窗口;
    this->setWindowFlags(Qt::FramelessWindowHint | Qt::WindowMinimizeButtonHint);
    // 设置窗口背景透明;
    setAttribute(Qt::WA_TranslucentBackground);
    // 初始化标题栏;
    initTitleBar();
    initdata();
    ui->retranslateUi(this);
}

BaseWindow::~BaseWindow()
{

}

void BaseWindow::initTitleBar()
{
    m_titleBar = new MyTitleBar(this);
    m_titleBar->move(0, 0);
    m_titleBar->setTitleContent("电梯管理系统");
    m_titleBar->setTitleIcon("C:/Users/hp/Desktop/170823140829.png");

    connect(m_titleBar, SIGNAL(signalButtonMinClicked()), this, SLOT(onButtonMinClicked()));
    connect(m_titleBar, SIGNAL(signalButtonRestoreClicked()), this, SLOT(onButtonRestoreClicked()));
    connect(m_titleBar, SIGNAL(signalButtonMaxClicked()), this, SLOT(onButtonMaxClicked()));
    connect(m_titleBar, SIGNAL(signalButtonCloseClicked()), this, SLOT(onButtonCloseClicked()));

}

void BaseWindow::initdata()
{
    //初始化检验项目内容
    QStringList D1;
    D1.append(
              "(1)使用登记资料，内容与实物相符\r"
              );
    D1.append(
                "(2)安全技术档案，至少包括 1.1、 1.2、 1.3 所述文件"
                "资料[1.2 的(3)项和 1.3 的(4)项除外]，以及监督检"
                "验报告、定期检验报告、日常检查与使用状况记录、"
                "日常维护保养记录、年度自行检查记录或者报告、"
                "应急救援演习记录、运行故障和事故记录等，保存"
                "完好(本规则实施前已经完成安装、改造或重大维修"
                "的， 1.1、 1.2、 1.3 项所述文件资料如有缺陷，应当"
                "由使用单位联系相关单位予以完善，可不作为本项"
                "审核结论的否决内容)；\r"
                );
    D1.append("(3)以岗位责任制为核心的电梯运行管理规章制度，"
              "包括事故与故障的应急措施和救援预案、电梯钥匙"
              "使用管理制度等；\r"
              );
    D1.append("(4)与取得相应资格单位签订的日常维护保养合同；\r"
              );
    D1.append("(5)按照规定配备的电梯安全管理和作业人员的特"
              "种设备作业人员证");
    Content_data.insert(1,D1);
    QStringList D2;
    D2.append(
              "(1)应当在任何情况下均能够安全方便地使用通道。"
               "采用梯子作为通道时，必须符合以下条件：\r"
                "①通往机房或者机器设备区间的通道不应当高出楼"
                "梯所到平面 4m；\r"
                "②梯子必须固定在通道上而不能被移动；\r"
                "③梯子高度超过 1.50m 时，其与水平方向的夹角应"
                "当在 65°～75°之间，并不易滑动或者翻转；\r"
                "④靠近梯子顶端应当设置把手。\r"
              );
    D2.append(
               "(2)通道应当设置永久性电气照明\r；"
                );
    D2.append("(3)机房通道门的宽度应当不小于 0.60m，高度应当"
              "不小于 1.80m，并且门不得向房内开启。门应当装有"
              "带钥匙的锁，并且可以从机房内不用钥匙打开。门"
              "外侧应当标明“机房重地，闲人免进”，或者有其他类"
              "似警示标志。\r"
              );
    Content_data.insert(2,D2);
    QStringList D3;
    D3.append(
                "(1)机房应当设置永久性电气照明；在机房内靠近入"
                "口(或多个入口)处的适当高度应当设有一个开关，"
                "控制机房照明；\r"
              );
    Content_data.insert(3,D3);
    QStringList D4;
    D4.append(
                "每台电梯应当具有断相、错相保护功能；电梯运行"
                "与相序无关时，可以不装设错相保护装置"
              );
    Content_data.insert(4,D4);
    QStringList D5;
    D5.append(
                "(2)主开关不得切断轿厢照明和通风、机房(机器设"
                "备间)照明和电源插座、轿顶与底坑的电源插座、电"
                "梯井道照明、报警装置的供电电路。"
              );
    Content_data.insert(5,D5);
    QStringList D6;
    D6.append(
                "(1)驱动主机工作时应当无异常噪声和振动。"
              );
    D6.append(
                "(3)曳引轮轮槽不得有严重磨损(适用于改造、维修"
                "监督检验和定期检验)，如果轮槽的磨损可能影响曳"
                "引能力时，应当进行曳引能力验证试验。\r"
              );
    Content_data.insert(6,D6);
    QStringList D7;
    D7.append(
                "(1)手动紧急操作装置应当符合以下要求：\r"
                "①对于可拆卸盘车手轮，设有一个电气安全装置，"
                "最迟在盘车手轮装上电梯驱动主机时动作；\r"
                "②松闸扳手涂成红色，盘车手轮是无辐条的并且涂"
                "成黄色，可拆卸盘车手轮放置在机房内容易接近的"
                "明显部位；\r"
                "③在电梯驱动主机上接近盘车手轮处，明显标出轿"
                "厢运行方向，如果手轮是不能拆卸的可以在手轮上"
                "标出；\r"
                "④能够通过操纵手动松闸装置松开制动器，并且需"
                "要以一个持续力保持其松开状态；\r"
                "⑤进行手动紧急操作时，易于观察到轿厢是否在开锁区\r"
              );
    D7.append(
                "(2)紧急电动运行装置应当符合以下要求：\r"
                "①依靠持续揿压按钮来控制轿厢运行，此按钮有防"
                "止误操作的保护，按钮上或其近旁标出相应的运行方向；\r"
                "②一旦进入检修运行，紧急电动运行装置控制轿厢"
                "运行的功能由检修控制装置所取代；\r"
                "③进行紧急电动运行操作时，易于观察到轿厢是否"
                "在开锁区\r"
              );
    D7.append(
                "(3)应急救援程序：在机房内应当设有清晰的应急救"
                "援程序"
              );
    Content_data.insert(7,D7);
    QStringList D8;
    D8.append(
                "(2)限速器或者其他装置上应当设有在轿厢上行或"
                "者下行速度达到限速器动作速度之前动作的电气安"
                "全装置，以及验证限速器复位状态的电气安全装置；"
              );
    D8.append(
                "(3)使用周期达到 2 年的电梯，或者限速器动作出现"
                "异常、限速器各调节部位封记损坏的电梯，应当由"
                "经许可的电梯检验机构或者电梯生产单位对限速器"
                "进行动作速度校验，并且由该单位出具校验报告"
              );
    Content_data.insert(8,D8);
    QStringList D9;
    D9.append(
                "(2)所有电气设备及线管、线槽的外露可以导电部分"
                "应当与保护线(PE)可靠连接"
              );
    Content_data.insert(9,D9);
    QStringList D10;
    D10.append(
                "动力电路、照明电路和电气安全装置电路的绝缘电"
                "阻应当符合下述要求：\r\r"
                "标称电压/V   测试电压(直流)/V   绝缘电阻/MΩ\r"
                "安全电压     250                ≥0.25\r"
                "≤500        500                ≥0.50\r"
                "＞500        1000               ≥1.00\r"
              );
    Content_data.insert(10,D10);
    QStringList D11;
    D11.append(
                "(3)门上应当装设用钥匙开启的锁，当门开启后不用"
                "钥匙能够将其关闭和锁住，在门锁住后，不用钥匙"
                "能够从井道内将门打开；"
              );
    D11.append(
                "(4)应当设置电气安全装置以验证门的关闭状态"
              );
    Content_data.insert(11,D11);
    QStringList D12;
    D12.append(
                "(3)应当装设用钥匙开启的锁，当门开启后不用钥匙"
                "能够将其关闭和锁住，在门锁住后，不用钥匙也能"
                "够从井道内将门打开；"
              );
    D12.append(
                "(4)应当设置电气安全装置以验证门的关闭状态"
              );
    Content_data.insert(12,D12);
    QStringList D13;
    D13.append(
                "井道上下两端应当装设极限开关，该开关"
                "在轿厢或者对重(如有)接触缓冲器前起作"
                "用，并且在缓冲器被压缩期间保持其动作"
                "状态。\r"
                "强制驱动电梯的极限开关动作后，应当以"
                "强制的机械方法直接切断驱动主机和制动"
                "器的供电回路"
              );
    Content_data.insert(13,D13);
    QStringList D14;
    D14.append(
                "随行电缆应当避免与限速器绳、选层器钢带、限位"
                "与极限开关等装置干涉，当轿厢压实在缓冲器上时，"
                "电缆不得与地面和轿厢底边框接触"
              );
    Content_data.insert(14,D14);
    QStringList D15;
    D15.append(
                "井道应当装设永久性电气照明。对于部分封闭井道，"
                "如果井道附近有足够的电气照明，井道内可以不设"
                "照明"
              );
    Content_data.insert(15,D15);
    QStringList D16;
    D16.append(
                "(1)底坑底部应当平整，不得渗水、漏水；"
              );
    D16.append(
                "(3)底坑内应当设置在进入底坑时和底坑地面上均"
                "能方便操作的停止装置，停止装置的操作装置为双"
                "稳态、红色并标以“停止”字样，并且有防止误操作的"
                "保护；"
              );
    Content_data.insert(16,D16);
    QStringList D17;
    D17.append(
                "(2)当限速器绳断裂或者过分伸长时，应当通过一个"
                "电气安全装置的作用，使电梯停止运转"
              );
    Content_data.insert(17,D17);
    QStringList D18;
    D18.append(
                "(3)缓冲器应当固定可靠；"
              );
    D18.append(
                "(4)耗能型缓冲器液位应当正确，有验证柱塞复位的"
                "电气安全装置；"
              );
    D18.append(
                "(5)对重缓冲器附近应当设置永久性的明显标识，标"
                "明当轿厢位于顶层端站平层位置时，对重装置撞板"
                "与其缓冲器顶面间的最大允许垂直距离；并且该垂"
                "直距离不超过最大允许值"
              );
    Content_data.insert(18,D18);
    QStringList D19;
    D19.append(
                "(1)轿顶应当装设一个易于接近的检修运行控制装"
                "置，并且符合以下要求：\r"
                "①由一个符合电气安全装置要求，能够防止误操作"
                "的双稳态开关(检修开关)进行操作；\r"
                "②一经进入检修运行时，即取消正常运行(包括任何"
                "自动门操作)、紧急电动运行、对接操作运行，只有"
                "再一次操作检修开关，才能使电梯恢复正常工作；\r"
                "③依靠持续揿压按钮来控制轿厢运行，此按钮有防止"
                "误操作的保护， 按钮上或其近旁标出相应的运行方向；\r"
                "④该装置上设有一个停止装置，停止装置的操作装"
                "置为双稳态、红色并标以“停止”字样，并且有防止误"
                "操作的保护；\r"
                "⑤检修运行时，安全装置仍然起作用。\r"
              );
    D19.append(
                "(2)轿顶应当装设一个从入口处易于接近的停止装"
                "置，停止装置的操作装置为双稳态、红色并标以“停止”"
                "字样，并且有防止误操作的保护。如果检修运行"
                "控制装置设在从入口处易于接近的位置，该停止装"
                "置也可以设在检修运行控制装置上；"
              );
    Content_data.insert(19,D19);
    QStringList D20;
    D20.append(
                "(3)其锁紧由电气安全装置予以验证"
              );
    Content_data.insert(20,D20);
    QStringList D21;
    D21.append(
                "如果对重(平衡重)由重块组成，应当可靠固定"
              );
    Content_data.insert(21,D21);
    QStringList D22;
    D22.append(
                "(2)对于为了满足使用要求而轿厢面积超出上述规"
                "定的载货电梯，必须满足以下条件：\r"
                "①在从层站装卸区域总可看见的位置上设置标志，"
                "表明该载货电梯的额定载重量；\r"
                "②该电梯专用于运送特定轻质货物，其体积可保证"
                "在装满轿厢情况下，该货物的总质量不会超过额定"
                "载重量；\r"
                "③该电梯由专职司机操作，并严格限制人员进入\r"
              );
    Content_data.insert(22,D22);
    QStringList D23;
    D23.append(
                "(1)正常照明电源中断时，能够自动接通紧急照明电源；"
              );
    D23.append(
                "(2)紧急报警装置采用对讲系统以便与救援服务持"
                "续联系，当电梯行程大于 30m 时，在轿厢和机房(或"
                "者紧急操作地点)之间也设置对讲系统，紧急报警装"
                "置的供电来自前条所述的紧急照明电源或者等效电"
                "源；在启动对讲系统后，被困乘客不必再做其他操作"
              );
    Content_data.insert(23,D23);
    QStringList D24;
    D24.append(
                "轿厢地坎下应当装设护脚板，其垂直部分的高度不"
                "小于 0.75m，宽度不小于层站入口宽度"
              );
    Content_data.insert(24,D24);
    QStringList D25;
    D25.append(
                "电梯应当设置轿厢超载保护装置，在轿厢内的载荷"
                "超过 110％额定载重量(超载量不少于 75kg)时，能"
                "够防止电梯正常启动及再平层，并且轿内有音响或"
                "者发光信号提示，动力驱动的自动门完全打开，手"
                "动门保持在未锁状态"
              );
    Content_data.insert(25,D25);
    QStringList D26;
    D26.append(
                "出现下列情况之一时，悬挂钢丝绳和补偿钢丝绳应"
                "当报废：\r"
                "①出现笼状畸变、绳芯挤出、扭结、部分压扁、弯"
                "折；\r"
                "②断丝分散出现在整条钢丝绳，任何一个捻距内单"
                "股的断丝数大于 4 根；或者断丝集中在钢丝绳某一"
                "部位或一股，一个捻距内断丝总数大于 12 根(对于"
                "股数为 6 的钢丝绳)或者大于 16 根(对于股数为 8 的"
                "钢丝绳)；\r"
                "③磨损后的钢丝绳直径小于钢丝绳公称直径的 90%。"
                "采用其他类型悬挂装置的，悬挂装置的磨损、变形"
                "等应当不超过制造单位设定的报废指标\r"
              );
    Content_data.insert(26,D26);
    QStringList D27;
    D27.append(
                "悬挂钢丝绳绳端固定应当可靠，弹簧、螺母、开口"
                "销等连接部件无缺损。"
                "对于强制驱动电梯，应当采用带楔块的压紧装置，"
                "或者至少用 3 个压板将钢丝绳固定在卷筒上。"
                "采用其他类型悬挂装置的，其端部固定应当符合制"
                "造单位的规定"
              );
    Content_data.insert(27,D27);
    QStringList D28;
    D28.append(
                "(1)补偿绳(链)端固定应当可靠；"
              );
    D28.append(
                "(2)应当使用电气安全装置来检查补偿绳的最小张"
                "紧位置；"
              );
    D28.append(
                "(3)当电梯的额定速度大于 3.5m/s 时，还应当设置补"
                "偿绳防跳装置，该装置动作时应当有一个电气安全"
                "装置使电梯驱动主机停止运转"
              );
    Content_data.insert(28,D28);
    QStringList D29;
    D29.append(
                "如果强制驱动电梯的轿厢悬挂在两根钢丝绳或者链"
                "条上，则应当设置检查绳(链)松弛的电气安全装置，"
                "当其中一根钢丝绳(链条)发生异常相对伸长时，电"
                "梯应当停止运行轿厢以检修速度运行，使松绳(链)"
                "电气安全装置动作，观察电梯运行状"
              );
    Content_data.insert(29,D29);
    QStringList D30;
    D30.append(
                "在机房(机器设备间)内的曳引轮、滑轮、链轮、限"
                "速器，在井道内的曳引轮、滑轮、链轮、限速器及"
                "张紧轮、补偿绳张紧轮，在轿厢上的滑轮、链轮等"
                "与钢丝绳、链条形成传动的旋转部件，均应当设置"
                "防护装置，以避免人身伤害、钢丝绳或链条因松弛而"
                "脱离绳槽或链轮、 异物进入绳与绳槽或链与链轮之间"
              );
    Content_data.insert(30,D30);
    QStringList D31;
    D31.append(
                "(1)门扇之间及门扇与立柱、门楣和地坎之间的间"
                "隙，对于乘客电梯不大于 6mm；对于载货电梯不大"
                "于8mm，使用过程中由于磨损，允许达到10mm；"
              );
    D31.append(
                "(2)在水平移动门和折叠门主动门扇的开启方向，以"
                "150N 的人力施加在一个最不利的点，前条所述的间"
                "隙允许增大，但对于旁开门不大于 30mm，对于中分"
                "门其总和不大于 45mm"
              );
    Content_data.insert(31,D31);
    QStringList D32;
    D32.append(
                "(1)玻璃门上有供应商名称或者商标、玻璃的型式等"
                "永久性标记；"
              );
    D32.append(
                "(2)玻璃门上的固定件，即使在玻璃下沉的情况下，"
                "也能够保证玻璃不会滑出；"
              );
    D32.append(
                "(3)有防止儿童的手被拖曳的措施"
              );
    Content_data.insert(32,D32);
    QStringList D33;
    D33.append(
                "动力驱动的自动水平滑动门应当设置防止门夹人的"
                "保护装置，当人员通过层门入口被正在关闭的门扇"
                "撞击或者将被撞击时，该装置应当自动使门重新开"
                "启"
              );
    Content_data.insert(33,D33);
    QStringList D34;
    D34.append(
                "层门和轿门正常运行时不得出现脱轨、机械卡"
                "阻或者在行程终端时错位；由于磨损、锈蚀或"
                "者火灾可能造成层门导向装置失效时，应当设"
                "置应急导向装置，使层门保持在原有位置"
              );
    Content_data.insert(34,D34);
    QStringList D35;
    D35.append(
                "在轿门驱动层门的情况下，当轿厢在开锁区域"
                "之外时，如果层门开启(无论何种原因)，应当"
                "有一种装置能够确保该层门自动关闭。自动关"
                "闭装置采用重块时，应当有防止重块坠落的措"
                "施"
              );
    Content_data.insert(35,D35);
    QStringList D36;
    D36.append(
                "每个层门均应当能够被一把符合要求的钥匙从"
                "外面开启；紧急开锁后，在层门闭合时门锁装"
                "置不应当保持开锁位置"
              );
    Content_data.insert(36,D36);
    QStringList D37;
    D37.append(
                "(1)每个层门都应当设置门锁装置，其锁紧动作"
                "应当由重力、永久磁铁或者弹簧来产生和保持，"
                "即使永久磁铁或者弹簧失效，重力亦不能导致开锁；"
              );
    D37.append(
                "(2)轿厢应当在锁紧元件啮合不小于 7mm 时才"
                "能启动；"
              );
    D37.append(
                "(3)门的锁紧应当由一个电气安全装置来验证，"
                "该装置应当由锁紧元件强制操作而没有任何中"
                "间机构，并且能够防止误动作；"
              );
    D37.append(
                "(4)如果轿门采用了门锁装置，该装置也应当符"
                "合以上有关要求"
              );
    Content_data.insert(37,D37);
    QStringList D38;
    D38.append(
                "(1)正常运行时应当不能打开层门，除非轿厢在"
                "该层门的开锁区域内停止或停站；如果一个层"
                "门或者轿门(或者多扇门中的任何一扇门)开"
                "着，在正常操作情况下，应当不能启动电梯或"
                "者不能保持继续运行；"
              );
    D38.append(
                "(2)每个层门和轿门的闭合都应当由电气安全"
                "装置来验证，如果滑动门是由数个间接机械连"
                "接的门扇组成，则未被锁住的门扇上也应当设"
                "置电气安全装置以验证其闭合状态"
              );
    Content_data.insert(38,D38);
    QStringList D39;
    D39.append(
                "轿门门刀与层门地坎，层门锁滚轮与轿厢地坎"
                "的间隙应当不小于 5mm；电梯运行时不得互相"
                "碰擦"
              );
    Content_data.insert(39,D39);
    QStringList D40;
    D40.append(
                "(2)设置检查机械锁定装置工作位置的电气安"
                "全装置，当该机械锁定装置处于非停放位置时，"
                "能防止轿厢的所有运行；"
              );
    D40.append(
                "(4)在检修门(窗)开启的情况下需要从轿内移"
                "动轿厢时，在检修门(窗)的附近设置轿内检修"
                "控制装置，轿内检修控制装置能够使检查门"
                "(窗)锁定位置的电气安全装置失效，人员站在"
                "轿顶时，不能使用该装置来移动轿厢；如果检"
                "修门(窗)的尺寸中较小的一个尺寸超过 0.20m，"
                "则井道内安装的设备与该检修门(窗)外边缘之"
                "间的距离应不小于 0.30m"
              );
    Content_data.insert(40,D40);
    QStringList D41;
    D41.append(
                "检查、维修驱动主机、控制柜的作业场地设在"
                "底坑时，如果检查、维修工作需要移动轿厢或"
                "可能导致轿厢的失控和意外移动，应当具有以"
                "下安全措施：\r"
                "(2)设置检查机械制停装置工作位置的电气安"
                "全装置，当机械制停装置处于非停放位置且未"
                "进入工作位置时，能防止轿厢的所有运行，当"
                "机械制停装置进入工作位置后，仅能通过检修"
                "装置来控制轿厢的电动移动；"
              );
    D41.append(
                "(3)在井道外设置电气复位装置，只有通过操纵"
                "该装置才能使电梯恢复到正常工作状态，该装"
                "置只能由工作人员操作"
              );
    Content_data.insert(41,D41);
    QStringList D42;
    D42.append(
                "(2)设有可以使平台进入(退出)工作位置的装"
                "置，该装置只能由工作人员在底坑或者在井道"
                "外操作，由一个电气安全装置确认平台完全缩"
                "回后电梯才能运行；"
              );
    D42.append(
                "(3)如果检查、维修作业不需要移动轿厢，则设置"
                "防止轿厢移动的机械锁定装置和检查机械锁定装"
                "置工作位置的电气安全装置，当机械锁定装置处于"
                "非停放位置时，能防止轿厢的所有运行；"
              );
    D42.append(
                "(4)如果检查(维修)作业需要移动轿厢， 则设置"
                "活动式机械止挡装置来限制轿厢的运行区间，"
                "当轿厢位于平台上方时，该装置能够使轿厢停"
                "在上方距平台至少 2m 处，当轿厢位于平台下"
                "方时， 该装置能够使轿厢停在平台下方符合 3.2"
                "井道顶部空间要求的位置；"
              );
    D42.append(
                "(5)设置检查机械止挡装置工作位置的电气安全"
                "装置，只有机械止挡装置处于完全缩回位置时才"
                "允许轿厢移动，只有机械止挡装置处于完全伸出"
                "位置时才允许轿厢在前条所限定的区域内移动。"
                "如果该平台不位于轿厢或者对重的运行通道"
                "中，则应当满足上述(1)的要求"
              );
    Content_data.insert(42,D42);
    QStringList D43;
    D43.append(
                "(1)用于紧急操作和动态试验(如制动试验、曳"
                "引力试验、限速器-安全钳联动试验、缓冲器试"
                "验及轿厢上行超速保护试验等)的装置应当能"
                "在井道外操作；在停电或停梯故障造成人员被"
                "困时，相关人员能够按照操作屏上的应急救援"
                "程序及时解救被困人员；"
              );
    D43.append(
                "(4)装置上应当设置停止装置"
              );
    Content_data.insert(43,D43);
    QStringList D44;
    D44.append(
                "(2)如果一个检修控制装置被转换到“检修”，"
                "则通过持续按压该控制装置上的按钮能够移动"
                "轿厢；如果两个检修控制装置均被转换到“检"
                "修”位置，则从任何一个检修控制装置都不可能"
                "移动轿厢，或者当同时按压两个检修控制装置"
                "上相同方向的按钮时，才能够移动轿厢"
              );
    Content_data.insert(44,D44);
    QStringList D45;
    D45.append(
                "当轿厢上行速度失控时，轿厢上行超速保护装"
                "置应当动作，使轿厢制停或者至少使其速度降"
                "低至对重缓冲器的设计范围；该装置动作时，"
                "应当使一个电气安全装置动作"
              );
    Content_data.insert(45,D45);
    QStringList D46;
    D46.append(
                "缓冲器动作后，回复至其正常伸长位置电梯才"
                "能正常运行；缓冲器完全复位的最大时间限度"
                "为 120s"
              );
    Content_data.insert(46,D46);
    QStringList D47;
    D47.append(
                "(2)定期检验：轿厢空载，以检修速度下行，进"
                "行限速器-安全钳联动试验，限速器、安全钳动"
                "作应当可靠"
              );
    Content_data.insert(47,D47);
    QStringList D48;
    D48.append(
                "轿厢空载，以检修速度上行，进行限速器-安全"
                "钳联动试验，限速器、安全钳动作应当可靠"
              );
    Content_data.insert(48,D48);
    QStringList D49;
    D49.append(
                "当对重压在缓冲器上而曳引机按电梯上"
                "行方向旋转时，应当不能提升空载轿厢"
              );
    Content_data.insert(49,D49);
    QStringList D50;
    D50.append(
                "轿厢分别空载、满载，以正常运行速度上、"
                "下运行，呼梯、楼层显示等信号系统功能"
                "有效、指示正确、动作无误，轿厢平层良"
                "好，无异常现象发生"
              );
    Content_data.insert(50,D50);
    QStringList D51;
    D51.append(
                "如果电梯设有消防返回功能，应当符合以"
                "下要求：\r"
                "(1)消防开关应当设在基站或者撤离层，防"
                "护玻璃应当完好，并且标有“消防”字样；\r"
                "(2)消防功能启动后，电梯不响应外呼和"
                "内选信号，轿厢直接返回指定撤离层，开"
                "门待命\r"
              );
    Content_data.insert(51,D51);
    QStringList D52;
    D52.append(
                "轿厢空载以正常运行速度上行时，切断电"
                "动机与制动器供电，轿厢应当完全停止，"
                "并且无明显变形和损坏"
              );
    Content_data.insert(52,D52);
    QStringList d1;
    d1.append(
                "(1)制造许可证明文件，其范围能够覆盖所提供电梯的相应参数；"
              );
    d1.append(
                "(2)电梯整机型式试验合格证书或者报告书，其内容"
                "能够覆盖所提供电梯的相应参数；"
              );
    d1.append(
                "(3)产品质量证明文件，注有制造许可证明文件编"
                "号、该电梯的产品出厂编号、主要技术参数，以及"
                "门锁装置、限速器、安全钳、缓冲器、含有电子元"
                "件的安全电路(如果有)、轿厢上行超速保护装置、"
                "驱动主机、控制柜等安全保护装置和主要部件的型"
                "号和编号等内容，并且有电梯整机制造单位的公章"
                "或者检验合格章以及出厂日期；"
              );
    d1.append(
                "(4)门锁装置、限速器、安全钳、缓冲器、含有电子元"
                "件的安全电路(如果有)、轿厢上行超速保护装置、驱动"
                "主机、控制柜等安全保护装置和主要部件的型式试验合"
                "格证，以及限速器和渐进式安全钳的调试证书；"
              );
    d1.append(
                "(5)机房或者机器设备间及井道布置图，其顶层高"
                "度、底坑深度、楼层间距、井道内防护、安全距离、"
                "井道下方人可以进入的空间等满足安全要求；"
              );
    d1.append(
                "(6)电气原理图，包括动力电路和连接电气安全装置的电路；"
              );
    d1.append(
                "(7)安装使用维护说明书，包括安装、使用、日常维"
                "护保养和应急救援等方面操作说明的内容。"
              );
    Content_data2.insert(1,d1);
    QStringList d2;
    d2.append(
                "(1)安装许可证和安装告知书，许可证范围能够覆盖"
                "所施工电梯的相应参数；"
              );
    d2.append(
                "(2)施工方案，审批手续齐全；"
              );
    d2.append(
                "(3)施工现场作业人员持有的特种设备作业人员证；"
              );
    d2.append(
                "(4)施工过程记录和自检报告，检查和试验项目齐"
                "全、内容完整，施工和验收手续齐全；"
              );
    d2.append(
                "(5)变更设计证明文件(如安装中变更设计时)，履行"
                "了由使用单位提出、经整机制造单位同意的程序；"
              );
    d2.append(
                "(6)安装质量证明文件，包括电梯安装合同编号、安"
                "装单位安装许可证编号、产品出厂编号、主要技术"
                "参数等内容，并且有安装单位公章或者检验合格章"
                "以及竣工日期。"
              );
    Content_data2.insert(2,d2);
    QStringList d3;
    d3.append(
                "(1)改造或者维修许可证和改造或者重大维修告知"
                "书，许可证范围能够覆盖所施工电梯的相应参数；"
              );
    d3.append(
                "(2)改造或者重大维修的清单以及施工方案，施工方"
                "案的审批手续齐全；"
              );
    d3.append(
                "(3)所更换的安全保护装置或者主要部件产品合格"
                "证、型式试验合格证书以及限速器和渐进式安全钳"
                "的调试证书(如发生更换)；"
              );
    d3.append(
                "(4)施工现场作业人员持有的特种设备作业人员证；"
              );
    d3.append(
                "(5)施工过程记录和自检报告，检查和试验项目齐"
                "全、内容完整，施工和验收手续齐全；"
              );
    d3.append(
                "(6)改造后的整梯合格证或者重大维修质量证明文"
                "件，合格证或者证明文件中包括电梯的改造或者重"
                "大维修合同编号、改造或者重大维修单位的资格证"
                "编号、电梯使用登记编号、主要技术参数等内容，"
                "并且有改造或者重大维修单位的公章或者检验合格"
                "章以及竣工日期。"
              );
    Content_data2.insert(3,d3);
    QStringList d4;
    d4.append(
                "(1)使用登记资料，内容与实物相符；"
              );
    d4.append(
                "(2)安全技术档案，至少包括 1.1、 1.2、 1.3 所述文件"
                "资料[1.2 的(3)项和 1.3 的(4)项除外]，以及监督检"
                "验报告、定期检验报告、日常检查与使用状况记录、"
                "日常维护保养记录、年度自行检查记录或者报告、"
                "应急救援演习记录、运行故障和事故记录等，保存"
                "完好(本规则实施前已经完成安装、改造或重大维修"
                "的， 1.1、 1.2、 1.3 项所述文件资料如有缺陷，应当"
                "由使用单位联系相关单位予以完善，可不作为本项"
                "审核结论的否决内容)；"
              );
    d4.append(
                "(3)以岗位责任制为核心的电梯运行管理规章制度，"
                "包括事故与故障的应急措施和救援预案、电梯钥匙"
                "使用管理制度等；"
              );
    d4.append(
                "(4)与取得相应资格单位签订的日常维护保养合同；"
              );
    d4.append(
                "(5)按照规定配备的电梯安全管理和作业人员的特"
                "种设备作业人员证"
              );
    Content_data2.insert(4,d4);
    QStringList d5;
    d5.append(
                "1)应当在任何情况下均能够安全方便地使用通道。"
                "采用梯子作为通道时，必须符合以下条件：\r"
                "①通往机房或者机器设备区间的通道不应当高出楼"
                "梯所到平面 4m；\r"
                "②梯子必须固定在通道上而不能被移动；\r"
                "③梯子高度超过 1.50m 时，其与水平方向的夹角应"
                "当在 65°～75°之间，并不易滑动或者翻转；\r"
                "④靠近梯子顶端应当设置把手。\r"
              );
    d5.append(
                "(2)通道应当设置永久性电气照明；"
              );
    d5.append(
                "(3)机房通道门的宽度应当不小于 0.60m，高度应当"
                "不小于 1.80m，并且门不得向房内开启。门应当装有"
                "带钥匙的锁，并且可以从机房内不用钥匙打开。门"
                "外侧应当标明“机房重地，闲人免进”，或者有其他类"
                "似警示标志"
              );
    Content_data2.insert(5,d5);
    QStringList d6;
    d6.append(
                "机房(机器设备间)应当专用，不得用于电梯以外的"
                "其他用途"
              );
    Content_data2.insert(6,d6);
    QStringList d7;
    d7.append(
                "(1)在控制屏和控制柜前有一块净空面积，其深度不"
                "小于 0.70m，宽度为 0.50m 或屏、柜的全宽(两者中"
                "的大值)，高度不小于 2m；"
              );
    d7.append(
                "(2)对运动部件进行维修和检查以及人工紧急操作"
                "的地方有一块不小于 0.50m×0.60m 的水平净空面"
                "积，其净高度不小于 2m；"
              );
    d7.append(
                "(3)机房地面高度不一并且相差大于 0.50m 时，应当"
                "设置楼梯或者台阶，并且设置护栏"
              );
    Content_data2.insert(7,d7);
    QStringList d8;
    d8.append(
                "机房地面上的开口应当尽可能小，位于井道上方的"
                "开口必须采用圈框，此圈框应当凸出地面至少 50mm"
              );
    Content_data2.insert(8,d8);
    QStringList d9;
    d9.append(
                "(1)机房应当设置永久性电气照明；在机房内靠近入"
                "口(或多个入口)处的适当高度应当设有一个开关，"
                "控制机房照明；"
              );
    d9.append(
                "(2)机房应当至少设置一个 2P＋PE 型电源插座；"
              );
    d9.append(
                "(3)应当在主开关旁设置控制井道照明、轿厢照明和"
                "插座电路电源的开关"
              );
    Content_data2.insert(9,d9);
    QStringList d10;
    d10.append(
                "每台电梯应当具有断相、错相保护功能；电梯运行"
                "与相序无关时，可以不装设错相保护装置"
              );
    Content_data2.insert(10,d10);
    QStringList d11;
    d11.append(
                "(1)每台电梯应当单独装设主开关，主开关应当易于"
                "接近和操作；无机房电梯主开关的设置还应当符合"
                "以下要求：\r"
                "①如果控制柜不是安装在井道内，主开关应当安装"
                "在控制柜内，如果控制柜安装在井道内，主开关应"
                "当设置在紧急操作屏上；\r"
                "②如果从控制柜处不容易直接操作主开关，该控制"
                "柜应当设置能分断主电源的断路器；\r"
                "③在电梯驱动主机附近 1m 之内， 应当有可以接近的"
                "主开关或者符合要求的停止装置，且能够方便地进"
                "行操作。"
              );
    d11.append(
                "(2)主开关不得切断轿厢照明和通风、机房(机器设"
                "备间)照明和电源插座、轿顶与底坑的电源插座、电"
                "梯井道照明、报警装置的供电电路；"
              );
    d11.append(
                "(3)主开关应当具有稳定的断开和闭合位置，并且在"
                "断开位置时能用挂锁或其他等效装置锁住，能够有"
                "效地防止误操作；"
              );
    d11.append(
                "(4)如果不同电梯的部件共用一个机房，则每台电梯"
                "的主开关应当与驱动主机、控制柜、限速器等采用"
                "相同的标志"
              );
    Content_data2.insert(11,d11);
    QStringList d12;
    d12.append(
                "(1)驱动主机工作时应当无异常噪声和振动；"
              );
    d12.append(
                "(2)曳引轮外侧面应当涂成黄色；"
              );
    d12.append(
                "(3)曳引轮轮槽不得有严重磨损(适用于改造、维修"
                "监督检验和定期检验)，如果轮槽的磨损可能影响曳"
                "引能力时，应当进行曳引能力验证试验"
              );
    Content_data2.insert(12,d12);
    QStringList d13;
    d13.append(
                "(1)所有参与向制动轮或盘施加制动力的制动器机"
                "械部件应当分两组装设；"
              );
    d13.append(
                "(2)电梯正常运行时，切断制动器电流至少应当用两"
                "个独立的电气装置来实现，当电梯停止时，如果其"
                "中一个接触器的主触点未打开，最迟到下一次运行"
                "方向改变时，应当防止电梯再运行"
              );
    Content_data2.insert(13,d13);
    QStringList d14;
    d14.append(
                "(1)手动紧急操作装置应当符合以下要求：\r"
                "①对于可拆卸盘车手轮，设有一个电气安全装置，"
                "最迟在盘车手轮装上电梯驱动主机时动作；\r"
                "②松闸扳手涂成红色，盘车手轮是无辐条的并且涂"
                "成黄色，可拆卸盘车手轮放置在机房内容易接近的"
                "明显部位；\r"
                "③在电梯驱动主机上接近盘车手轮处，明显标出轿"
                "厢运行方向，如果手轮是不能拆卸的可以在手轮上"
                "标出；\r"
                "④能够通过操纵手动松闸装置松开制动器，并且需"
                "要以一个持续力保持其松开状态；\r"
                "⑤进行手动紧急操作时，易于观察到轿厢是否在开锁区\r"
              );
    d14.append(
                "(2)紧急电动运行装置应当符合以下要求：\r"
                "①依靠持续揿压按钮来控制轿厢运行，此按钮有防"
                "止误操作的保护，按钮上或其近旁标出相应的运行方向；\r"
                "②一旦进入检修运行，紧急电动运行装置控制轿厢"
                "运行的功能由检修控制装置所取代；\r"
                "③进行紧急电动运行操作时，易于观察到轿厢是否"
                "在开锁区\r"
              );
    d14.append(
                "(3)应急救援程序：在机房内应当设有清晰的应急救"
                "援程序"
              );
    Content_data2.insert(14,d14);
    QStringList d15;
    d15.append(
                "(1) 限速器上应当设有铭牌，标明制造单位名称、"
                "型号、规格参数和型式试验机构标识，铭牌和型式"
                "试验合格证、调试证书内容应当相符；"
              );
    d15.append(
                "(2)限速器或者其他装置上应当设有在轿厢上行或"
                "者下行速度达到限速器动作速度之前动作的电气安"
                "全装置，以及验证限速器复位状态的电气安全装置；"
              );
    d15.append(
                "(3)使用周期达到 2 年的电梯，或者限速器动作出现"
                "异常、限速器各调节部位封记损坏的电梯，应当由"
                "经许可的电梯检验机构或者电梯生产单位对限速器"
                "进行动作速度校验，并且由该单位出具校验报告"
              );
    Content_data2.insert(15,d15);
    QStringList d16;
    d16.append(
                "(1)供电电源自进入机房或者机器设备间起，中性线"
                "(N)与保护线(PE)应当始终分开；"
              );
    d16.append(
                "(2)所有电气设备及线管、线槽的外露可以导电部分"
                "应当与保护线(PE)可靠连接"
              );
    Content_data2.insert(16,d16);
    QStringList d17;
    d17.append(
                "动力电路、照明电路和电气安全装置电路的绝缘电"
                "阻应当符合下述要求：\r\r"
                "标称电压/V   测试电压(直流)/V   绝缘电阻/MΩ\r"
                "安全电压     250                ≥0.25\r"
                "≤500        500                ≥0.50\r"
                "＞500        1000               ≥1.00\r"
              );
    Content_data2.insert(17,d17);
    QStringList d18;
    d18.append(
                "轿厢上行超速保护装置上应当设有铭牌，标明制造"
                "单位名称、型号、规格参数和型式试验机构标识，"
                "铭牌和型式试验合格证内容应当相符；电梯整机制"
                "造单位应当在控制屏或者紧急操作屏上标注轿厢上"
                "行超速保护装置的动作试验方法"
              );
    Content_data2.insert(18,d18);
    QStringList d19;
    d19.append(
                "除必要的开口外井道应当完全封闭；当建筑物中不"
                "要求井道在火灾情况下具有防止火焰蔓延的功能"
                "时，允许采用部分封闭井道，但在人员可正常接近"
                "电梯处应当设置无孔的高度足够的围壁，以防止人"
                "员遭受电梯运动部件直接危害，或者用手持物体触"
                "及井道中的电梯设备"
              );
    Content_data2.insert(19,d19);
    QStringList d20;
    d20.append(
                "(1)当对重完全压在缓冲器上时， 应当同时满足以下条件：\r"
                "①轿厢导轨提供不小于 0.1+0.035v2(m)的进一步制"
                "导行程；\r"
                "②轿顶可以站人的最高面积的水平面与位于轿厢投"
                "影部分井道顶最低部件的水平面之间的自由垂直距"
                "离不小于 1.0+0.035v2(m)；\r"
                "③井道顶的最低部件与轿顶设备的最高部件之间的"
                "间距(不包括导靴、钢丝绳附件等)不小于"
                "0.3+0.035v2(m)，与导靴或滚轮、曳引绳附件、垂直"
                "滑动门的横梁或部件的最高部分之间的间距不小于"
                "0.1+0.035v2(m)；\r"
                "④轿顶上方应当有一个不小于 0.5m×0.6m×0.8m 的"
                "空间(任意平面朝下即可)。/r"
                "注 A－4：当采用减行程缓冲器并对电梯驱动主机正常减速"
                "进行有效监控时 0.035v2 可以用下值代替：\r"
                "①电梯额定速度不大于 4m/s 时，可以减少到 1/2，但是不小"
                "于 0.25m；\r"
                "②电梯额定速度大于4m/s 时，可以减少到1/3，但是不小于0.28m。\r"
              );
    d20.append(
                "(2) 当轿厢完全压在缓冲器上时，对重导轨有不小于"
                "0.1+0.035v2(m)的制导行程"
              );
    Content_data2.insert(20,d20);
    QStringList d21;
    d21.append(
                "(1)轿厢从顶层向上直到撞击上缓冲器时的行程不"
                "小于 0.50m，轿厢上行至缓冲器行程的极限位置时一"
                "直处于有导向状态；"
              );
    d21.append(
                "(2)当轿厢完全压在上缓冲器上时，应当同时满足以"
                "下条件：\r"
                "①轿顶可以站人的最高面积的水平面与位于轿厢投"
                "影部分井道顶最低部件的水平面之间的自由垂直距"
                "离不小于 1.0m；\r"
                "②井道顶部最低部件与轿顶设备的最高部件之间的"
                "自由垂直距离不小于 0.30m，与导靴或滚轮、钢丝绳附"
                "件、垂直滑动门横梁等的自由垂直距离不小于 0.10m；\r"
                "③轿厢顶部上方有一个不小于 0.50m×0.60m×0.80m"
                "的空间(任意平面朝下均可)。\r"
              );
    d21.append(
                "(3)当轿厢完全压在缓冲器上时，平衡重(如果有)导"
                "轨的长度能提供不小于 0.30m 的进一步制导行程"
              );
    Content_data2.insert(21,d21);
    QStringList d22;
    d22.append(
                "(1)当相邻两层门地坎的间距大于 11m 时，其间应当"
                "设置高度不小于 1.80m、宽度不小于 0.35m 的井道安"
                "全门(使用轿厢安全门时除外)；"
              );
    d22.append(
                "(2)不得向井道内开启；"
              );
    d22.append(
                "(3)门上应当装设用钥匙开启的锁，当门开启后不用"
                "钥匙能够将其关闭和锁住，在门锁住后，不用钥匙"
                "能够从井道内将门打开；"
              );
    d22.append(
                "(4)应当设置电气安全装置以验证门的关闭状态"
              );
    Content_data2.insert(22,d22);
    QStringList d23;
    d23.append(
                "(1)高度不小于 1.40m，宽度不小于 0.60m；"
              );
    d23.append(
                "(2)不得向井道内开启；"
              );
    d23.append(
                "(3)门上应当装设用钥匙开启的锁，当门开启后不用"
                "钥匙能够将其关闭和锁住，在门锁住后，不用钥匙"
                "能够从井道内将门打开；"
              );
    d23.append(
                "(4)应当设置电气安全装置以验证门的关闭状态"
              );
    Content_data2.insert(23,d23);
    QStringList d24;
    d24.append(
                "(1)每根导轨应当至少有 2 个导轨支架，其间距一般"
                "不大于 2.50m(如果间距大于 2.50m 应当有计算依"
                "据)，端部短导轨的支架数量应当满足设计要求；"
              );
    d24.append(
                "(2)支架应当安装牢固，焊接支架的焊缝满足设计要"
                "求，锚栓(如膨胀螺栓)固定只能在井道壁的混凝土"
                "构件上使用；"
              );
    d24.append(
                "(3)每列导轨工作面每 5m 铅垂线测量值间的相对最"
                "大偏差，轿厢导轨和设有安全钳的 T 型对重导轨不大"
                "于 1.2mm，不设安全钳的 T 型对重导轨不大于 2.0mm；"
              );
    d24.append(
                "(4)两列导轨顶面的距离偏差，轿厢导轨为 0～"
                "+2mm，对重导轨为 0～+3mm"
              );
    Content_data2.insert(24,d24);
    QStringList d25;
    d25.append(
                "轿厢与面对轿厢入口的井道壁的间距不大"
                "于 0.15m，对于局部高度小于 0.50m 或者"
                "采用垂直滑动门的载货电梯，该间距可以"
                "增加到 0.20m。"
                "如果轿厢装有机械锁紧的门并且门只能在"
                "开锁区内打开时，则上述间距不受限制"
              );
    Content_data2.insert(25,d25);
    QStringList d26;
    d26.append(
                "每个层门地坎下的井道壁应当符合以下要求：\r"
                "形成一个与层门地坎直接连接的连续垂直"
                "表面，由光滑而坚硬的材料构成(如金属薄"
                "板)；其高度不小于开锁区域的一半加上"
                "50mm，宽度不小于门入口的净宽度两边"
                "各加 25mm"
              );
    Content_data2.insert(26,d26);
    QStringList d27;
    d27.append(
                "(1)对重(或者平衡重)的运行区域应当采"
                "用刚性隔障保护，该隔障从底坑地面上不"
                "大于 0.30m 处，向上延伸到离底坑地面至"
                "少 2.5m 的高度，宽度应当至少等于对重"
                "(或者平衡重)宽度两边各加 0.10m；"
              );
    d27.append(
                "(2)在装有多台电梯的井道中，不同电梯的"
                "运动部件之间应当设置隔障，隔障应当至"
                "少从轿厢、对重(或平衡重)行程的最低点"
                "延伸到最低层站楼面以上 2.50m 高度，并"
                "且有足够的宽度以防止人员从一个底坑通"
                "往另一个底坑，如果轿厢顶部边缘和相邻"
                "电梯的运动部件之间的水平距离小于"
                "0.5m，隔障应当贯穿整个井道，宽度至少"
                "等于运动部件或者运动部件的需要保护部"
                "分的宽度每边各加 0.10m"
              );
    Content_data2.insert(27,d27);
    QStringList d28;
    d28.append(
                "井道上下两端应当装设极限开关，该开关"
                "在轿厢或者对重(如有)接触缓冲器前起作"
                "用，并且在缓冲器被压缩期间保持其动作"
                "状态。"
                "强制驱动电梯的极限开关动作后，应当以"
                "强制的机械方法直接切断驱动主机和制动"
                "器的供电回路"
              );
    Content_data2.insert(28,d28);
    QStringList d29;
    d29.append(
                "随行电缆应当避免与限速器绳、选层器钢带、限位"
                "与极限开关等装置干涉，当轿厢压实在缓冲器上时，"
                "电缆不得与地面和轿厢底边框接触"
              );
    Content_data2.insert(29,d29);
    QStringList d30;
    d30.append(
                "井道应当装设永久性电气照明。对于部分封闭井道，"
                "如果井道附近有足够的电气照明，井道内可以不设"
                "照明"
              );
    Content_data2.insert(30,d30);
    QStringList d31;
    d31.append(
                "(1)底坑底部应当平整，不得渗水、漏水；"
              );
    d31.append(
                "(2)如果没有其他通道，应当在底坑内设置一个从层"
                "门进入底坑的永久性装置(如梯子)，该装置不得凸"
                "入电梯的运行空间；"
              );
    d31.append(
                "(3)底坑内应当设置在进入底坑时和底坑地面上均"
                "能方便操作的停止装置，停止装置的操作装置为双"
                "稳态、红色并标以“停止”字样，并且有防止误操作的"
                "保护；"
              );
    d31.append(
                "(4)底坑内应当设置 2P+PE 型电源插座，以及在进入"
                "底坑时能方便操作的井道灯开关"
              );
    Content_data2.insert(31,d31);
    QStringList d32;
    d32.append(
                "1)底坑中有一个不小于 0.50m×0.60m×1.0m 的空间"
                "(任一面朝下即可)；"
              );
    d32.append(
                "(2)底坑底面与轿厢最低部件的自由垂直距离不小"
                "于 0.50m，当垂直滑动门的部件、护脚板和相邻井道"
                "壁之间，轿厢最低部件和导轨之间的水平距离在"
                "0.15m 之内时，此垂直距离允许减少到 0.10m；当轿"
                "厢最低部件和导轨之间的水平距离大于 0.15m 但不"
                "大于 0.5m 时，此垂直距离可按线性关系增加至 0.5m；"
              );
    d32.append(
                "(3)底坑中固定的最高部件和轿厢最低部件之间的"
                "距离不小于 0.30m"
              );
    Content_data2.insert(32,d32);
    QStringList d33;
    d33.append(
                "(1)限速器绳应当用张紧轮张紧，张紧轮(或者其配"
                "重)应当有导向装置；"
              );
    d33.append(
                "(2)当限速器绳断裂或者过分伸长时，应当通过一个"
                "电气安全装置的作用，使电梯停止运转"
              );
    Content_data2.insert(33,d33);
    QStringList d34;
    d34.append(
                "(1)轿厢和对重的行程底部极限位置应当设置缓冲"
                "器， 强制驱动电梯还应当在行程上部极限位置设置缓"
                "冲器；蓄能型缓冲器只能用于额定速度不大于 1m/s"
                "的电梯，耗能型缓冲器可以用于任何额定速度的电梯；"
              );
    d34.append(
                "(2)缓冲器上应当设有铭牌或者标签，标明制造单位"
                "名称、型号、规格参数和型式试验机构标识，铭牌"
                "或者标签和型式试验合格证内容应当相符；"
              );
    d34.append(
                "(3)缓冲器应当固定可靠；"
              );
    d34.append(
                "(4)耗能型缓冲器液位应当正确，有验证柱塞复位的"
                "电气安全装置；"
              );
    d34.append(
                "(5)对重缓冲器附近应当设置永久性的明显标识，标"
                "明当轿厢位于顶层端站平层位置时，对重装置撞板"
                "与其缓冲器顶面间的最大允许垂直距离；并且该垂"
                "直距离不超过最大允许值"
              );
    Content_data2.insert(34,d34);
    QStringList d35;
    d35.append(
                "如果对重(平衡重)之下有人能够到达的空间，应当"
                "将对重缓冲器安装于一直延伸到坚固地面上的实心"
                "桩墩，或者在对重(平衡重)上装设安全钳"
              );
    Content_data2.insert(35,d35);
    QStringList d36;
    d36.append(
                "(1)轿顶应当装设一个易于接近的检修运行控制装"
                "置，并且符合以下要求：\r"
                "①由一个符合电气安全装置要求，能够防止误操作"
                "的双稳态开关(检修开关)进行操作；\r"
                "②一经进入检修运行时，即取消正常运行(包括任何"
                "自动门操作)、紧急电动运行、对接操作运行，只有"
                "再一次操作检修开关，才能使电梯恢复正常工作；\r"
                "③依靠持续揿压按钮来控制轿厢运行，此按钮有防止"
                "误操作的保护， 按钮上或其近旁标出相应的运行方向；\r"
                "④该装置上设有一个停止装置，停止装置的操作装"
                "置为双稳态、红色并标以“停止”字样，并且有防止误"
                "操作的保护；\r"
                "⑤检修运行时，安全装置仍然起作用。\r"
              );
    d36.append(
                "(2)轿顶应当装设一个从入口处易于接近的停止装"
                "置，停止装置的操作装置为双稳态、红色并标以“停"
                "止”字样，并且有防止误操作的保护。如果检修运行"
                "控制装置设在从入口处易于接近的位置，该停止装"
                "置也可以设在检修运行控制装置上；"
              );
    d36.append(
                "(3)轿顶应当装设 2P+PE 型电源插座"
              );
    Content_data2.insert(36,d36);
    QStringList d37;
    d37.append(
                "(1)由扶手、 0.10m 高的护脚板和位于护栏高度一半处"
                "的中间栏杆组成；"
              );
    d37.append(
                "(2)当自由距离不大于 0.85m 时，扶手高度不小于 0.70m，"
                "当自由距离大于 0.85m 时，扶手高度不小于 1.10m；"
              );
    d37.append(
                "(3)护栏装设在距轿顶边缘最大为 0.15m 之内，并且其扶"
                "手外缘和井道中的任何部件之间的水平距离不小于 0.10m；"
              );
    d37.append(
                "(4)护栏上有关于俯伏或斜靠护栏危险的警示符号或须知"
              );
    Content_data2.insert(37,d37);
    QStringList d38;
    d38.append(
                "(1)设有手动上锁装置，能够不用钥匙从轿厢外开启，"
                "用规定的三角钥匙从轿厢内开启；"
              );
    d38.append(
                "(2)轿厢安全窗不能向轿厢内开启，并且开启位置不超"
                "出轿厢的边缘，轿厢安全门不能向轿厢外开启，并且出"
                "入路径没有对重(平衡重)或者固定障碍物；"
              );
    d38.append(
                "(3)其锁紧由电气安全装置予以验证"
              );
    Content_data2.insert(38,d38);
    QStringList d39;
    d39.append(
                "轿厢及关联部件与对重(平衡重)之间的距离应当不小"
                "于 50mm"
              );
    Content_data2.insert(39,d39);
    QStringList d40;
    d40.append(
                "如果对重(平衡重)由重块组成，应当可靠固定"
              );
    Content_data2.insert(40,d40);
    QStringList d41;
    d41.append(
                "(1)轿厢有效面积应当符合下述规定：\r"
                "Q① S② Q① S② Q① S② Q① S②\r"
                "100③ 0.37  525  1.45  900   2.20  1275  2.95\r"
                "180④ 0.58  600  1.60  975   2.35  1350  3.10\r"
                "225   0.70  630  1.66  1000  2.40  1425  3.25\r"
                "300   0.90  675  1.75  1050  2.50  1500  3.40\r"
                "375   1.10  750  1.90  1125  2.65  1600  3.56\r"
                "400   1.17  800  2.00  1200  2.80  2000  4.20\r"
                "450   1.30  825  2.05  1250  2.90  2500⑤5.00\r"
                "对于非商用汽车电梯，额定载重量应当按照单位轿厢有效面积"
                "不小于 200kg/m2 计算。\r"
                "注 A－5:①额定载重量， kg； ②轿厢最大有效面积， m2； ③一"
                "人电梯的最小值； ④二人电梯的最小值； ⑤额定载重量超过"
                "2500kg 时，每增加 100kg，面积增加 0.16m2。对中间的载重量，"
                "其面积由线性插入法确定"
              );
    d41.append(
                "(2)对于为了满足使用要求而轿厢面积超出上述规"
                "定的载货电梯，必须满足以下条件：\r"
                "①在从层站装卸区域总可看见的位置上设置标志，"
                "表明该载货电梯的额定载重量；\r"
                "②该电梯专用于运送特定轻质货物，其体积可保证"
                "在装满轿厢情况下，该货物的总质量不会超过额定"
                "载重量；\r"
                "③该电梯由专职司机操作，并严格限制人员进入\r"
              );
    Content_data2.insert(41,d41);
    QStringList d42;
    d42.append(
                "轿厢内应当设置铭牌，标明额定载重量及乘客人数"
                "(载货电梯只标载重量)、制造厂名称或商标；改造"
                "后的电梯，铭牌上应当标明额定载重量及乘客人数"
                "(载货电梯只标定载重量)、改造单位名称、改造竣"
                "工日期等"
              );
    Content_data2.insert(42,d42);
    QStringList d43;
    d43.append(
                "(1)正常照明电源中断时，能够自动接通紧急照明电源；"
              );
    d43.append(
                "(2)紧急报警装置采用对讲系统以便与救援服务持"
                "续联系，当电梯行程大于 30m 时，在轿厢和机房(或"
                "者紧急操作地点)之间也设置对讲系统，紧急报警装"
                "置的供电来自前条所述的紧急照明电源或者等效电"
                "源；在启动对讲系统后，被困乘客不必再做其他操作"
              );
    Content_data2.insert(43,d43);
    QStringList d44;
    d44.append(
                "轿厢地坎下应当装设护脚板，其垂直部分的高度不"
                "小于 0.75m，宽度不小于层站入口宽度"
              );
    Content_data2.insert(44,d44);
    QStringList d45;
    d45.append(
                "电梯应当设置轿厢超载保护装置，在轿厢内的载荷"
                "超过 110％额定载重量(超载量不少于 75kg)时，能"
                "够防止电梯正常启动及再平层，并且轿内有音响或"
                "者发光信号提示，动力驱动的自动门完全打开，手"
                "动门保持在未锁状态"
              );
    Content_data2.insert(45,d45);
    QStringList d46;
    d46.append(
                "(1)安全钳上应当设有铭牌，标明制造单位名称、型"
                "号、规格参数和型式试验机构标识，铭牌、型式试"
                "验合格证、调试证书内容与实物应当相符；"
              );
    d46.append(
                "(2)轿厢上应当装设一个在轿厢安全钳动作以前或"
                "同时动作的电气安全装置"
              );
    Content_data2.insert(46,d46);
    QStringList d47;
    d47.append(
                "出现下列情况之一时，悬挂钢丝绳和补偿钢丝绳应"
                "当报废：\r"
                "①出现笼状畸变、绳芯挤出、扭结、部分压扁、弯"
                "折；\r"
                "②断丝分散出现在整条钢丝绳，任何一个捻距内单"
                "股的断丝数大于 4 根；或者断丝集中在钢丝绳某一"
                "部位或一股，一个捻距内断丝总数大于 12 根(对于"
                "股数为 6 的钢丝绳)或者大于 16 根(对于股数为 8 的"
                "钢丝绳)；\r"
                "③磨损后的钢丝绳直径小于钢丝绳公称直径的 90%。"
                "采用其他类型悬挂装置的，悬挂装置的磨损、变形"
                "等应当不超过制造单位设定的报废指标\r"
              );
    Content_data2.insert(47,d47);
    QStringList d48;
    d48.append(
                "悬挂钢丝绳绳端固定应当可靠，弹簧、螺母、开口"
                "销等连接部件无缺损。"
                "对于强制驱动电梯，应当采用带楔块的压紧装置，"
                "或者至少用 3 个压板将钢丝绳固定在卷筒上。"
                "采用其他类型悬挂装置的，其端部固定应当符合制"
                "造单位的规定"
              );
    Content_data2.insert(48,d48);
    QStringList d49;
    d49.append(
                "(1)补偿绳(链)端固定应当可靠；"
              );
    d49.append(
                "(2)应当使用电气安全装置来检查补偿绳的最小张"
                "紧位置；"
              );
    d49.append(
                "(3)当电梯的额定速度大于 3.5m/s 时，还应当设置补"
                "偿绳防跳装置，该装置动作时应当有一个电气安全"
                "装置使电梯驱动主机停止运转"
              );
    Content_data2.insert(49,d49);
    QStringList d50;
    d50.append(
                "(1)轿厢完全压缩缓冲器时，卷筒的绳槽中应当至少"
                "保留两圈钢丝绳；"
              );
    d50.append(
                "(2)卷筒上只能卷绕一层钢丝绳；"
              );
    d50.append(
                "(3)应当有措施防止钢丝绳滑脱和跳出"
              );
    Content_data2.insert(50,d50);
    QStringList d51;
    d51.append(
                "如果强制驱动电梯的轿厢悬挂在两根钢丝绳或者链"
                "条上，则应当设置检查绳(链)松弛的电气安全装置，"
                "当其中一根钢丝绳(链条)发生异常相对伸长时，电"
                "梯应当停止运行"
              );
    Content_data2.insert(51,d51);
    QStringList d52;
    d52.append(
                "在机房(机器设备间)内的曳引轮、滑轮、链轮、限"
                "速器，在井道内的曳引轮、滑轮、链轮、限速器及"
                "张紧轮、补偿绳张紧轮，在轿厢上的滑轮、链轮等"
                "与钢丝绳、链条形成传动的旋转部件，均应当设置"
                "防护装置，以避免人身伤害、钢丝绳或链条因松弛而"
                "脱离绳槽或链轮、 异物进入绳与绳槽或链与链轮之间"
              );
    Content_data2.insert(52,d52);
    QStringList d53;
    d53.append(
                "轿厢地坎与层门地坎的水平距离不得大于 35mm"
              );
    Content_data2.insert(53,d53);
    QStringList d54;
    d54.append(
                "(1)门扇之间及门扇与立柱、门楣和地坎之间的间"
                "隙，对于乘客电梯不大于 6mm；对于载货电梯不大"
                "于8mm，使用过程中由于磨损，允许达到10mm；"
              );
    d54.append(
                "(2)在水平移动门和折叠门主动门扇的开启方向，以"
                "150N 的人力施加在一个最不利的点，前条所述的间"
                "隙允许增大，但对于旁开门不大于 30mm，对于中分"
                "门其总和不大于 45mm"
              );
    Content_data2.insert(54,d54);
    QStringList d55;
    d55.append(
                "(1)玻璃门上有供应商名称或者商标、玻璃的型式等"
                "永久性标记；"
              );
    d55.append(
                "(2)玻璃门上的固定件，即使在玻璃下沉的情况下，"
                "也能够保证玻璃不会滑出；"
              );
    d55.append(
                "(3)有防止儿童的手被拖曳的措施"
              );
    Content_data2.insert(55,d55);
    QStringList d56;
    d56.append(
                "动力驱动的自动水平滑动门应当设置防止门夹人的"
                "保护装置，当人员通过层门入口被正在关闭的门扇"
                "撞击或者将被撞击时，该装置应当自动使门重新开"
                "启"
              );
    Content_data2.insert(56,d56);
    QStringList d57;
    d57.append(
                "层门和轿门正常运行时不得出现脱轨、机械卡"
                "阻或者在行程终端时错位；由于磨损、锈蚀或"
                "者火灾可能造成层门导向装置失效时，应当设"
                "置应急导向装置，使层门保持在原有位置"
              );
    Content_data2.insert(57,d57);
    QStringList d58;
    d58.append(
                "在轿门驱动层门的情况下，当轿厢在开锁区域"
                "之外时，如果层门开启(无论何种原因)，应当"
                "有一种装置能够确保该层门自动关闭。自动关"
                "闭装置采用重块时，应当有防止重块坠落的措"
                "施"
              );
    Content_data2.insert(58,d58);
    QStringList d59;
    d59.append(
                "每个层门均应当能够被一把符合要求的钥匙从"
                "外面开启；紧急开锁后，在层门闭合时门锁装"
                "置不应当保持开锁位置"
              );
    Content_data2.insert(59,d59);
    QStringList d60;
    d60.append(
                "(1)每个层门都应当设置门锁装置，其锁紧动作"
                "应当由重力、永久磁铁或者弹簧来产生和保持，"
                "即使永久磁铁或者弹簧失效，重力亦不能导致开锁；"
              );
    d60.append(
                "(2)轿厢应当在锁紧元件啮合不小于 7mm 时才"
                "能启动；"
              );
    d60.append(
                "(3)门的锁紧应当由一个电气安全装置来验证，"
                "该装置应当由锁紧元件强制操作而没有任何中"
                "间机构，并且能够防止误动作；"
              );
    d60.append(
                "(4)如果轿门采用了门锁装置，该装置也应当符"
                "合以上有关要求"
              );
    Content_data2.insert(60,d60);
    QStringList d61;
    d61.append(
                "(1)正常运行时应当不能打开层门，除非轿厢在"
                "该层门的开锁区域内停止或停站；如果一个层"
                "门或者轿门(或者多扇门中的任何一扇门)开"
                "着，在正常操作情况下，应当不能启动电梯或"
                "者不能保持继续运行；"
              );
    d61.append(
                "(2)每个层门和轿门的闭合都应当由电气安全"
                "装置来验证，如果滑动门是由数个间接机械连"
                "接的门扇组成，则未被锁住的门扇上也应当设"
                "置电气安全装置以验证其闭合状态"
              );
    Content_data2.insert(61,d61);
    QStringList d62;
    d62.append(
                "轿门门刀与层门地坎，层门锁滚轮与轿厢地坎"
                "的间隙应当不小于 5mm；电梯运行时不得互相"
                "碰擦"
              );
    Content_data2.insert(62,d62);
    QStringList d63;
    d63.append(
                "(1)作业场地的结构与尺寸应当保证工作人员"
                "能够安全、方便地进出和进行维修(检查)作业"
                "(参见 2.3)；"
              );
    d63.append(
                "(2)作业场地应当设置永久性电气照明，在靠近"
                "工作场地入口处应当设置照明开关"
              );
    Content_data2.insert(63,d63);
    QStringList d64 ;
    d64.append(
                "(1)设置防止轿厢移动的机械锁定装置；"
              );
    d64.append(
                "(2)设置检查机械锁定装置工作位置的电气安"
                "全装置，当该机械锁定装置处于非停放位置时，"
                "能防止轿厢的所有运行；"
              );
    d64.append(
                "(3)若在轿厢壁上设置检修门(窗)，则该门(窗)"
                "不得向轿厢外打开，并且装有用钥匙开启的锁，"
                "不用钥匙能够关闭和锁住，同时设置检查检修"
                "门(窗)锁定位置的电气安全装置；"
              );
    d64.append(
                "(4)在检修门(窗)开启的情况下需要从轿内移"
                "动轿厢时，在检修门(窗)的附近设置轿内检修"
                "控制装置，轿内检修控制装置能够使检查门"
                "(窗)锁定位置的电气安全装置失效，人员站在"
                "轿顶时，不能使用该装置来移动轿厢；如果检"
                "修门(窗)的尺寸中较小的一个尺寸超过 0.20m，"
                "则井道内安装的设备与该检修门(窗)外边缘之"
                "间的距离应不小于 0.30m"
              );
    Content_data2.insert(64,d64);
    QStringList d65 ;
    d65.append(
                "(1)设置停止轿厢运动的机械制停装置， 使作业"
                "场地内的地面与轿厢最低部件之间的距离不小"
                "于 2m；"
              );
    d65.append(
                "(2)设置检查机械制停装置工作位置的电气安"
                "全装置，当机械制停装置处于非停放位置且未"
                "进入工作位置时，能防止轿厢的所有运行，当"
                "机械制停装置进入工作位置后，仅能通过检修"
                "装置来控制轿厢的电动移动；"
              );
    d65.append(
                "(3)在井道外设置电气复位装置，只有通过操纵"
                "该装置才能使电梯恢复到正常工作状态，该装"
                "置只能由工作人员操作"
              );
    Content_data2.insert(65,d65);
    QStringList d66 ;
    d66.append(
                "(1)平台是永久性装置，有足够的机械强度，并"
                "且设置护栏；"
              );
    d66.append(
                "(2)设有可以使平台进入(退出)工作位置的装"
                "置，该装置只能由工作人员在底坑或者在井道"
                "外操作，由一个电气安全装置确认平台完全缩"
                "回后电梯才能运行；"
              );
    d66.append(
                "(3)如果检查、维修作业不需要移动轿厢，则设置"
                "防止轿厢移动的机械锁定装置和检查机械锁定装"
                "置工作位置的电气安全装置，当机械锁定装置处于"
                "非停放位置时，能防止轿厢的所有运行；"
              );
    d66.append(
                "(4)如果检查(维修)作业需要移动轿厢， 则设置"
                "活动式机械止挡装置来限制轿厢的运行区间，"
                "当轿厢位于平台上方时，该装置能够使轿厢停"
                "在上方距平台至少 2m 处，当轿厢位于平台下"
                "方时， 该装置能够使轿厢停在平台下方符合 3.2"
                "井道顶部空间要求的位置；"
              );
    d66.append(
                "(5)设置检查机械止挡装置工作位置的电气安全"
                "装置，只有机械止挡装置处于完全缩回位置时才"
                "允许轿厢移动，只有机械止挡装置处于完全伸出"
                "位置时才允许轿厢在前条所限定的区域内移动。"
                "如果该平台不位于轿厢或者对重的运行通道"
                "中，则应当满足上述(1)的要求"
              );
    Content_data2.insert(66,d66);
    QStringList d67 ;
    d67.append(
                "(1)用于紧急操作和动态试验(如制动试验、曳"
                "引力试验、限速器-安全钳联动试验、缓冲器试"
                "验及轿厢上行超速保护试验等)的装置应当能"
                "在井道外操作；在停电或停梯故障造成人员被"
                "困时，相关人员能够按照操作屏上的应急救援"
                "程序及时解救被困人员；"
              );
    d67.append(
                "(2)应当能够直接或者通过显示装置观察到轿"
                "厢的运动方向、速度以及是否位于开锁区；"
              );
    d67.append(
                "(3)装置上应当设置永久性照明和照明开关；"
              );
    d67.append(
                "(4)装置上应当设置停止装置"
              );
    Content_data2.insert(67,d67);
    QStringList d68 ;
    d68.append(
                "(1)每台电梯只能设置 1 个附加检修装置；附加"
                "检修控制装置的型式要求与轿顶检修控制装置"
                "相同；"
              );
    d68.append(
                "(2)如果一个检修控制装置被转换到“检修”，"
                "则通过持续按压该控制装置上的按钮能够移动"
                "轿厢；如果两个检修控制装置均被转换到“检"
                "修”位置，则从任何一个检修控制装置都不可能"
                "移动轿厢，或者当同时按压两个检修控制装置"
                "上相同方向的按钮时，才能够移动轿厢"
              );
    Content_data2.insert(68,d68);
    QStringList d69 ;
    d69.append(
                "当轿厢上行速度失控时，轿厢上行超速保护装"
                "置应当动作，使轿厢制停或者至少使其速度降"
                "低至对重缓冲器的设计范围；该装置动作时，"
                "应当使一个电气安全装置动作"
              );
    Content_data2.insert(69,d69);
    QStringList d70 ;
    d70.append(
                "缓冲器动作后，回复至其正常伸长位置电梯才"
                "能正常运行；缓冲器完全复位的最大时间限度"
                "为 120s"
              );
    Content_data2.insert(70,d70);
    QStringList d71 ;
    d71.append(
                "(1)施工监督检验：轿厢装有下述载荷，以检修"
                "速度下行，进行限速器-安全钳联动试验，限速"
                "器、安全钳动作应当可靠:\r"
                "①瞬时式安全钳，轿厢装载额定载重量，对于"
                "轿厢面积超出规定的载货电梯，以轿厢实际面"
                "积按规定所对应的额定载重量作为试验载荷；\r"
                "②渐进式安全钳，轿厢装载 1.25 倍额定载荷，"
                "对于轿厢面积超出规定的载货电梯，取 1.25 倍"
                "额定载重量与轿厢实际面积按规定所对应的额"
                "定载重量两者中的较大值作为试验载荷；\r"
                "③对于轿厢面积超过相应规定的非商用汽车电"
                "梯，轿厢装载 150％额定载重量。\r"
              );
    Content_data2.insert(71,d71);
    QStringList d72 ;
    d72.append(
                "轿厢空载，以检修速度上行，进行限速器-安全"
                "钳联动试验，限速器、安全钳动作应当可靠"
              );
    Content_data2.insert(72,d72);
    QStringList d73 ;
    d73.append(
                "曳引电梯的平衡系数应当在 0.40～0.50 之"
                "间，或者符合制造(改造)单位的设计值"
              );
    Content_data2.insert(73,d73);
    QStringList d74 ;
    d74.append(
                "当对重压在缓冲器上而曳引机按电梯上"
                "行方向旋转时，应当不能提升空载轿厢"
               );
    Content_data2.insert(74,d74);
    QStringList d75 ;
    d75.append(
                "轿厢分别空载、满载，以正常运行速度上、"
                "下运行，呼梯、楼层显示等信号系统功能"
                "有效、指示正确、动作无误，轿厢平层良"
                "好，无异常现象发生"
               );
    Content_data2.insert(75,d75);
    QStringList d76 ;
    d76.append(
                "如果电梯设有消防返回功能，应当符合以"
                "下要求：\r"
                "(1)消防开关应当设在基站或者撤离层，防"
                "护玻璃应当完好，并且标有“消防”字样；\r"
                "(2)消防功能启动后，电梯不响应外呼和"
                "内选信号，轿厢直接返回指定撤离层，开"
                "门待命\r"
               );
    Content_data2.insert(76,d76);
    QStringList d77 ;
    d77.append(
                "当电源为额定频率，电动机施以额定电压"
                "时，轿厢承载 0.5 倍额定载重量，向下运"
                "行至行程中段(除去加速和减速段)时的"
                "速度，不得大于额定速度的 105％，不宜"
                "小于额定速度的 92％"
               );
    Content_data2.insert(77,d77);
    QStringList d78 ;
    d78.append(
                "轿厢空载以正常运行速度上行时，切断电"
                "动机与制动器供电，轿厢应当完全停止，"
                "并且无明显变形和损坏"
               );
    Content_data2.insert(78,d78);
    QStringList d79 ;
    d79.append(
                "轿厢装载 1.25 倍额定载重量，以正常运"
                "行速度下行至行程下部，切断电动机与制"
                "动器供电，曳引机应当停止运转，轿厢应"
                "当完全停止，并且无明显变形和损坏"
               );
    Content_data2.insert(79,d79);
    QStringList d80 ;
    d80.append(
                "对于轿厢面积超过相应规定的载货电梯，"
                "以轿厢实际面积所对应的 1.25 倍额定载"
                "重量进行静态曳引试验，对于轿厢面积超"
                "过相应规定的非商用汽车电梯，以 1.5 倍"
                "额定载重量做静态曳引试验，历时"
                "10min，曳引绳应当没有打滑现象"
               );
    Content_data2.insert(80,d80);



    TEST T1,T2,T3,T4,T5,T6,T7,T8,T9,T10,
         T11,T12,T13,T14,T15,T16,T17,T18,T19,T20,
         T21,T22,T23,T24,T25,T26,T27,T28,T29,T30,
         T31,T32,T33,T34,T35,T36,T37,T38,T39,T40,
         T41,T42,T43,T44,T45,T46,T47,T48,T49,T50,
         T51,T52;
    T_data.append(T1);
    T_data.append(T2);
    T_data.append(T3);
    T_data.append(T4);
    T_data.append(T5);
    T_data.append(T6);
    T_data.append(T7);
    T_data.append(T8);
    T_data.append(T9);
    T_data.append(T10);
    T_data.append(T11);
    T_data.append(T12);
    T_data.append(T13);
    T_data.append(T14);
    T_data.append(T15);
    T_data.append(T16);
    T_data.append(T17);
    T_data.append(T18);
    T_data.append(T19);
    T_data.append(T20);
    T_data.append(T21);
    T_data.append(T22);
    T_data.append(T23);
    T_data.append(T24);
    T_data.append(T25);
    T_data.append(T26);
    T_data.append(T27);
    T_data.append(T28);
    T_data.append(T29);
    T_data.append(T30);
    T_data.append(T31);
    T_data.append(T32);
    T_data.append(T33);
    T_data.append(T34);
    T_data.append(T35);
    T_data.append(T36);
    T_data.append(T37);
    T_data.append(T38);
    T_data.append(T39);
    T_data.append(T40);
    T_data.append(T41);
    T_data.append(T42);
    T_data.append(T43);
    T_data.append(T44);
    T_data.append(T45);
    T_data.append(T46);
    T_data.append(T47);
    T_data.append(T48);
    T_data.append(T49);
    T_data.append(T50);
    T_data.append(T51);
    T_data.append(T52);
    for(int i=0;i<T_data.count();i++)
        {
        T_data[i].text_type=testType[i];
        T_data[i].name=testName[i];
        T_data[i].content=Content_data.value(i+1);
        T_data[i].method=testMethod[i];
    }
    TEST t1,t2,t3,t4,t5,t6,t7,t8,t9,t10,t11,t12,t13,t14,t15,t16,t17,t18,t19,t20,t21,
            t22,t23,t24,t25,t26,t27,t28,t29,t30,t31,t32,t33,t34,t35,t36,t37,t38,t39,
            t40,t41,t42,t43,t44,t45,t46,t47,t48,t49,t50,t51,t52,t53,t54,t55,t56,t57,
            t58,t59,t60,t61,t62,t63,t64,t65,t66,t67,t68,t69,t70,t71,t72,t73,t74,t75,
            t76,t77,t78,t79,t80;
    T_data2.append(t1);
    T_data2.append(t2);
    T_data2.append(t3);
    T_data2.append(t4);
    T_data2.append(t5);
    T_data2.append(t6);
    T_data2.append(t7);
    T_data2.append(t8);
    T_data2.append(t9);
    T_data2.append(t10);
    T_data2.append(t11);
    T_data2.append(t12);
    T_data2.append(t13);
    T_data2.append(t14);
    T_data2.append(t15);
    T_data2.append(t16);
    T_data2.append(t17);
    T_data2.append(t18);
    T_data2.append(t19);
    T_data2.append(t20);
    T_data2.append(t21);
    T_data2.append(t22);
    T_data2.append(t23);
    T_data2.append(t24);
    T_data2.append(t25);
    T_data2.append(t26);
    T_data2.append(t27);
    T_data2.append(t28);
    T_data2.append(t29);
    T_data2.append(t30);
    T_data2.append(t31);
    T_data2.append(t32);
    T_data2.append(t33);
    T_data2.append(t34);
    T_data2.append(t35);
    T_data2.append(t36);
    T_data2.append(t37);
    T_data2.append(t38);
    T_data2.append(t39);
    T_data2.append(t40);
    T_data2.append(t41);
    T_data2.append(t42);
    T_data2.append(t43);
    T_data2.append(t44);
    T_data2.append(t45);
    T_data2.append(t46);
    T_data2.append(t47);
    T_data2.append(t48);
    T_data2.append(t49);
    T_data2.append(t50);
    T_data2.append(t51);
    T_data2.append(t52);
    T_data2.append(t53);
    T_data2.append(t54);
    T_data2.append(t55);
    T_data2.append(t56);
    T_data2.append(t57);
    T_data2.append(t58);
    T_data2.append(t59);
    T_data2.append(t60);
    T_data2.append(t61);
    T_data2.append(t62);
    T_data2.append(t63);
    T_data2.append(t64);
    T_data2.append(t65);
    T_data2.append(t66);
    T_data2.append(t67);
    T_data2.append(t68);
    T_data2.append(t69);
    T_data2.append(t70);
    T_data2.append(t71);
    T_data2.append(t72);
    T_data2.append(t73);
    T_data2.append(t74);
    T_data2.append(t75);
    T_data2.append(t76);
    T_data2.append(t77);
    T_data2.append(t78);
    T_data2.append(t79);
    T_data2.append(t80);
    for(int i=0;i<T_data2.count();i++)
        {
        T_data2[i].text_type=testType2[i];
        T_data2[i].name=testName2[i];
        T_data2[i].content=Content_data2.value(i+1);
        T_data2[i].method=testMethod2[i];
    }
    model = new QStandardItemModel(0,2,this);
    model->setHeaderData(0, Qt::Horizontal, tr("Service"));
    model->setHeaderData(1, Qt::Horizontal, tr("Details"));
    for(int i=0;i<52;i++)
    {
        QStandardItem* rootItem=new QStandardItem(T_data[i].name);
        model->appendRow(rootItem);
        for(int m=0;m<T_data[i].content.count();m++)
        {
            QStandardItem* item=new QStandardItem(QString("内容%1").arg(QString::number(m+1)));
            rootItem->appendRow(item);
            QStandardItem* item2=new QStandardItem("");
            rootItem->setChild(m,1,item2);
        }
        QStandardItem* rootItem2=new QStandardItem("");
        rootItem2->setCheckable(false);
        model->setItem(i,1,rootItem2);
    }
    connect(model,SIGNAL(dataChanged(QModelIndex,QModelIndex,QVector<int>)),this,SLOT(on_treeview_datachanged(QModelIndex, QModelIndex, QVector<int>)));
    ui->treeView->setModel(model);
    ui->treeView->setEditTriggers(QAbstractItemView::NoEditTriggers);
    ui->treeView->resizeColumnToContents(0);
    ui->treeView->resizeColumnToContents(1);

    int i= ui->treeView->width();


    QFile file("C:/Users/Administrator/Desktop/chuibai.QSS");
     file.open(QIODevice::ReadOnly);
     QString s=file.readAll();
     file.close();
     this->setStyleSheet(s);

     //radiobutton
     buttongroup= new QButtonGroup(this);
     buttongroup->addButton(ui->radioButton,1);
     buttongroup->addButton(ui->radioButton_2,2);
     connect(buttongroup,SIGNAL(buttonClicked(QAbstractButton*)),this,SLOT(onRadiobuttonClicked(QAbstractButton*)));
     initmenebar();
     //layout();//这个必须放最后。不然之后添加的控件没加入布局
}

void BaseWindow::paintEvent(QPaintEvent* event)
{
    // 	Q_UNUSED(event);
    // 	QStyleOption opt;
    // 	opt.init(this);
    // 	QPainter painter(this);
    // 	style()->drawPrimitive(QStyle::PE_Widget, &opt, &painter, this);

    //设置背景色;
    QPainter painter(this);
    QPainterPath pathBack;
    pathBack.setFillRule(Qt::WindingFill);
    pathBack.addRoundedRect(QRect(0, 0, this->width(), this->height()), 3, 3);
    painter.setRenderHint(QPainter::SmoothPixmapTransform, true);
    painter.fillPath(pathBack, QBrush(QColor(240, 240, 240)));
//    painter.fillPath(pathBack, QBrush(QPixmap("C:/Users/hp/Desktop/timg.jpg")));

    return QWidget::paintEvent(event);
}

void BaseWindow::loadStyleSheet(const QString &sheetName)
{
    QFile file(":/Resources/" + sheetName + ".css");
    file.open(QFile::ReadOnly);
    if (file.isOpen())
    {
        QString styleSheet = this->styleSheet();
        styleSheet += QLatin1String(file.readAll());
        this->setStyleSheet(styleSheet);
    }
}

void BaseWindow::initmenebar()
{
    //auto layout = new QVBoxLayout(this);//创建一个水平布局,且将这个laout manager关联到window
    //layout->setGeometry(QRect(10,0,800,40));

    menubar=new  QMenuBar(ui->widget);
    file=new QMenu("设备",this);
    addDevice=new QAction("新增设备",this);
    file->addAction(addDevice);
    menubar->addMenu(file);
    ui->widget->setGeometry(0,m_titleBar->height()-5,this->width(),file->height()-5);
    qDebug()<<this->width()<<file->height();
    menubar->setGeometry(0,0,ui->widget->width(),ui->widget->height());
    //ui->widget->resize(1043,30);

}

void BaseWindow::layout()//这个必须放最后。不然之后添加的控件没加入布局
{
    QVBoxLayout * Vlayout=new QVBoxLayout(this);
    //Vlayout->addWidget(m_titleBar,0,Qt::AlignTop);
    this->setLayout(Vlayout);
}

void BaseWindow::onButtonMinClicked()
{
    if (Qt::Tool == (windowFlags() & Qt::Tool))
    {
        hide();    //设置了Qt::Tool 如果调用showMinimized()则窗口就销毁了？？？
    }
    else
    {
        showMinimized();
    }
}

void BaseWindow::onButtonRestoreClicked()
{
    QPoint windowPos;
    QSize windowSize;
    m_titleBar->getRestoreInfo(windowPos, windowSize);
    this->setGeometry(QRect(windowPos, windowSize));
}

void BaseWindow::onButtonMaxClicked()
{
    m_titleBar->saveRestoreInfo(this->pos(), QSize(this->width(), this->height()));
    QRect desktopRect = QApplication::desktop()->availableGeometry();
    QRect FactRect = QRect(desktopRect.x() - 3, desktopRect.y() - 3, desktopRect.width() + 6, desktopRect.height() + 6);
    setGeometry(FactRect);
}

void BaseWindow::onButtonCloseClicked()
{
    close();

}

void BaseWindow::on_pushButton_clicked()
{

//    qDebug()<<s;
}

void BaseWindow::on_treeView_doubleClicked(const QModelIndex &index)
{
    QModelIndex Index=ui->treeView->model()->parent(index);
    if(Index.column()==-1)//根节点的parent为空
    {

    }else
    {
//        QPropertyAnimation *animation = new QPropertyAnimation(ui->widget,"geometry");
//        animation->setDuration(10000);
//        animation->setStartValue(ui->widget->rect());
//        animation->setEndValue(QRect(250, 250, 100, 30));
//        animation->start();

        currentItem=Index.row();//当前检验项目
        currentItem_c=index.row();//当前检验内容行

        ui->textBrowser->setText(T_data[Index.row()].content[index.row()]);
        ui->label_2->setText(T_data[Index.row()].method[0]);
        ui->label_5->setText(T_data[Index.row()].name);
    }
}

void BaseWindow::on_treeview_datachanged(QModelIndex before, QModelIndex after, QVector<int> vector)
{
    //每次数据发生改变时，对比所有子项，更新根节点的结果。
    QModelIndex Index=ui->treeView->model()->parent(before);
    if(Index.column()==-1)//根节点的parent为空
    {

    }else
    {
        QStandardItemModel *model=static_cast<QStandardItemModel*>(ui->treeView->model());
        QStandardItem* rootItem= model->itemFromIndex(Index);
        bool result=true;
        for(int i=0;i<rootItem->rowCount();i++)
        {
            if(rootItem->child(i,1)->checkState()==Qt::Unchecked)
            {
                result =false;
            }
        }
        QStandardItem* rootItem2= model->item(currentItem,1);
        if(result)
        {
            rootItem2->setCheckState(Qt::Checked);
        }else
        {
            rootItem2->setCheckState(Qt::Unchecked);
        }

    }




}

void BaseWindow::onRadiobuttonClicked(QAbstractButton *)
{
    QModelIndex index=ui->treeView->model()->index(currentItem,0);
    QStandardItemModel * model = static_cast < QStandardItemModel *>(ui->treeView->model());
    QStandardItem *item=model->itemFromIndex(index);

    if(buttongroup->button(1)->isChecked())//
    {
        QStandardItem *child=item->child(currentItem_c,1);
        child->setData("通过",Qt::DisplayRole);
        child->setCheckState(Qt::Checked);
        child->setForeground(QBrush(Qt::black));
//        item->setCheckState(Qt::Checked);
//        item->setData("通过",Qt::DisplayRole);
//        item->setForeground(QBrush(Qt::black));
    }else
    {

        QStandardItem *child=item->child(currentItem_c,1);
        child->setData("不通过",Qt::DisplayRole);
        child->setCheckState(Qt::Unchecked);
        child->setForeground(QBrush(Qt::red));
//            item->setCheckState(Qt::Unchecked);
//            item->setData("不通过",Qt::DisplayRole);
//            item->setForeground(QBrush(Qt::red));
    }
}
